Repository: CrandellWS/jhbuild
Catalog: doc/*/*.po
Languages: el

source: A string specifying how the checkout is performed for directories in version control. Defaults to <literal>update</literal>. This can be set per module using <varname>module_checkout_mode</varname>. Possible values are <literal>update</literal> (update checkout directory), <literal>clobber</literal> (wipe out directory before checking out the sources), <literal>export</literal> (wipe out directory then create an unversioned copy of the sources) and <literal>copy</literal> (checkout in a directory different from the one it will build).
el: Μια συμβολοσειρά που ορίζει πώς θα εκτελείται ο έλεγχος εξόδου για καταλόγους στον έλεγχο έκδοσης. Προεπιλογή το <literal>ενημέρωση</literal>. Αυτό μπορεί να οριστεί ανά ενότητα χρησιμοποιώντας το <varname>module_checkout_mode</varname>. Δυνατές τιμές είναι <literal>ενημέρωση</literal> (ενημέρωση καταλόγου ελέγχου εξόδου), <literal>αντικατάσταση</literal> (διαγραφή καταλόγου πριν τον έλεγχο εξόδου των πηγών), <literal>εξαγωγή</literal> (διαγραφή καταλόγου, έπειτα δημιουργία ενός αντιγράφου χωρίς έκδοση των πηγών) και <literal>αντιγραφή</literal> (έλεγχος εξόδου σε έναν κατάλογο διαφορετικό από τον κατάλογο δόμησης).

source: A string specifying the directory to copy to, if the copy <link linkend="cfg-checkout-mode"> <varname>checkout_mode</varname></link> is in use. Defaults to the checkout directory.
el: Μια συμβολοσειρά που καθορίζει τον κατάλογο αντιγραφής, αν το αντίγραφο είναι σε χρήση <link linkend="cfg-checkout-mode"> <varname>checkout_mode</varname></link>. Η προεπιλογή είναι ο κατάλογος αντιγράφου εργασίας.

source: A string specifying which program to use for CVS support. This can be <literal>git-cvsimport</literal>, or <literal>cvs</literal>. Defaults to <literal>cvs</literal>.
el: Μια συμβολοσειρά που ορίζει ποιο πρόγραμμα θα χρησιμοποιηθεί για υποστήριξη CVS. Αυτό μπορεί να είναι <literal>git-cvsimport</literal>, ή <literal>cvs</literal>. Προεπιλογή το <literal>cvs</literal>.

source: A string specifying a local mirror directory. JHBuild will create local mirrors of repositories at the specified directory. The mirrors can be shared by multiple repository groups, saving space and time because hard-links will be used for local clones. The commands <command>update</command> and <command>updateone</command> will create the mirrors and fetch new commits from the online repositories. This option is only supported by Git and Bazaar repositories.
el: Μια συμβολοσειρά που ορίζει έναν τοπικό κατάλογο κατοπτρισμού. Το JHBuild θα δημιουργήσει τοπικούς κατοπτρισμούς των αποθετηρίων στον συγκεκριμένο κατάλογο. Οι κατοπτρισμοί μπορούν να μεριστούν από πολλαπλές ομάδες αποθετηρίου, εξοικονομώντας χώρο και χρόνο επειδή θα χρησιμοποιηθούν σκληροί δεσμοί για τοπικούς κλώνους. Οι εντολές <command>update</command> and <command>updateone</command> θα δημιουργήσουν τους κατοπτρισμούς και θα προσκομίσουν νέες υποβολές από τα δικτυακά αποθετήρια. Αυτή η επιλογή υποστηρίζεται μόνο από τα αποθετήρια Git και Bazaar.

source: A tuple specifying a help website name and URL. The website is displayed in the tinderbox html for failed modules. <varname>%(module)s</varname> in the URL will be replaced with the module name. To disable, set <varname>help_website</varname> to <literal>None</literal>. Defaults to <literal>('Gnome Live!', 'http://live.gnome.org/JhbuildIssues/%(module)s')</literal>.
el: Μια πλειάδα που ορίζει ένα όνομα ιστοτόπου βοήθειας και URL. Ο ιστότοπος εμφανίζεται στο tinderbox html για αποτυχημένες ενότητες. Το <varname>%(module)s</varname> στο URL θα αντικατασταθεί με το όνομα της ενότητας. Για απενεργοποίησή του, ορίστε το <varname>help_website</varname> σε <literal>None</literal>. Προεπιλογή το <literal>('Gnome Live!', 'http://live.gnome.org/JhbuildIssues/%(module)s')</literal>.

source: A string specifying a program to use as replacement for <literal>/usr/bin/install</literal>. If available, defaults to the <literal>install-check</literal> wrapper provided by JHBuild. The <literal>install-check</literal> wrapper optimizes header installation to reduce the time taken for rebuilds.
el: Μια συμβολοσειρά που ορίζει ένα πρόγραμμα για χρήση ως αντικατάσταση του <literal>/usr/bin/install</literal>. Αν είναι διαθέσιμο, προεπιλογή είναι το περίβλημα <literal>install-check</literal> που παρέχεται από το JHBuild. Το περίβλημα <literal>install-check</literal> βελτιστοποιεί την εγκατάσταση κεφαλίδας για να μειώσει τον απαιτούμενο χρόνο για αναδομήσεις.

source: A boolean value specifying whether to ignore soft dependencies when calculating the dependency tree. Defaults to <constant>False</constant>.
el: Μια τιμή Μπουλ καθορίζει εάν θα αγνοηθούν απαλές εξαρτήσεις όταν υπολογίζει το δένδρο εξάρτησης. Η προεπιλογή είναι <constant>False</constant>.

source: A boolean value specifying whether to interact with the user. Setting this value to <constant>False</constant> is equivalent to passing the <option>--no-interact</option> option. Defaults to <constant>True</constant>.
el: Μια τιμή Μπουλ που ορίζει αν θα αλληλεπιδράσει με τον χρήστη. Ορίζοντας αυτήν την τιμή σε <constant>False</constant> είναι ισοδύναμο με το πέρασμα της επιλογής <option>--no-interact</option>. Προεπιλογή το <constant>True</constant>.

source: A boolean value specifying whether to run <command>make check</command> after <command>make</command>. Defaults to <constant>False</constant>.
el: Μια τιμή Μπουλ που ορίζει αν θα εκτελεστεί το <command>make check</command> μετά το <command>make</command>. Προεπιλογή το <constant>False</constant>.

source: A boolean value specifying whether failures when running <command>make check</command> should be advisory only and not cause a build failure. Defaults to <constant>False</constant>.
el: Μια τιμή Μπουλ που ορίζει αν οι αποτυχίες κατά την εκτέλεση του <command>make check</command> πρέπει να είναι μόνο συμβουλευτικές και να μην προκαλούν αποτυχία δόμησης. Προεπιλογή το <constant>False</constant>.

source: A boolean value specifying whether to run <command>make clean</command> before <command>make</command>. Defaults to <constant>False</constant>.
el: Μια τιμή Μπουλ που ορίζει αν θα εκτελεστεί το <command>make clean</command> πριν το <command>make</command>. Προεπιλογή το <constant>False</constant>.

source: A boolean value specifying whether to run <command>make dist</command> after <command>make</command>. Defaults to <constant>False</constant>. This setting is equivalent to passing the <option>--dist</option> option.
el: Μια τιμή Μπουλ που ορίζει αν θα εκτελεστεί το <command>make dist</command> μετά το <command>make</command>. Προεπιλογή το <constant>False</constant>. Αυτή η ρύθμιση είναι ισοδύναμη με το πέρασμα της επιλογής <option>--dist</option>.

source: A boolean value specifying whether to run <command>make distcheck</command> after <command>make</command>. Defaults to <constant>False</constant>. This setting is equivalent to passing the <option>--distcheck</option> option.
el: Μια τιμή Μπουλ που ορίζει αν θα εκτελεστεί το <command>make distcheck</command> μετά το <command>make</command>. Προεπιλογή το <constant>False</constant>. Αυτή η ρύθμιση είναι ισοδύναμη με το πέρασμα της επιλογής <option>--distcheck</option>.

source: A dictionary mapping module names to strings specifying the arguments to be passed to <command>autogen.sh</command>. The setting in <varname>module_autogenargs</varname> is used instead of the global <varname>autogenargs</varname> setting. If a particular module isn't listed in the dictionary, the global <varname>autogenargs</varname> will be used.
el: Ένα λεξικό που αντιστοιχίζει τα ονόματα των ενοτήτων σε συμβολοσειρές ορίζοντας τα ορίσματα που περνάνε στο <command>autogen.sh</command>. Η ρύθμιση στο <varname>module_autogenargs</varname> χρησιμοποιείται αντί για την καθολική ρύθμιση <varname>autogenargs</varname>. Αν μια συγκεκριμένη ενότητα δεν είναι στη λίστα στο λεξικό, θα χρησιμοποιηθεί η καθολική <varname>autogenargs</varname>.

source: A dictionary specifying which checkout mode to use for modules. This overrides the global <varname>checkout_mode</varname> setting.
el: Ένα λεξικό που ορίζει ποια κατάσταση ελέγχου εξόδου θα χρησιμοποιηθεί για τις ενότητες. Αυτό υπερισχύει της καθολικής ρύθμισης <varname>checkout_mode</varname>.

source: A dictionary mapping module names to strings specifying the arguments to pass to <command>make</command>. The setting in <varname>module_makeargs</varname> replaces the value of <varname>makeargs</varname>. If a particular module isn't listed in the dictionary, the global <varname>makeargs</varname> will be used.
el: Ένα λεξικό που αντιστοιχίζει τα ονόματα των ενοτήτων σε συμβολοσειρές ορίζοντας τα ορίσματα που περνάνε στο <command>make</command>. Η ρύθμιση στο <varname>module_makeargs</varname> αντικαθιστά την τιμή του <varname>makeargs</varname>. Αν μια συγκεκριμένη ενότητα δεν είναι στη λίστα στο λεξικό, θα χρησιμοποιηθεί η καθολική <varname>makeargs</varname>.

source: A dictionary mapping module names to boolean values specifying whether to run <command>make check</command> after <command>make</command>. The setting in <varname>module_makecheck</varname> replaces the value of <varname>makecheck</varname>. If a particular module isn't listed in the dictionary, the global <varname>makecheck</varname> will be used.
el: Ένα λεξικό που αντιστοιχίζει τα ονόματα των ενοτήτων σε τιμές Μπουλ ορίζοντας αν θα εκτελεστεί το <command>make check</command> μετά το <command>make</command>. Η ρύθμιση στο <varname>module_makecheck</varname> αντικαθιστά την τιμή του <varname>makecheck</varname>. Αν μια συγκεκριμένη ενότητα δεν είναι στη λίστα στο λεξικό, θα χρησιμοποιηθεί η καθολική <varname>makecheck</varname>.

source: A dictionary mapping module names to boolean values. If a module is set to <constant>True</constant>, JHBuild will attempt to build dependent modules even if the specified module failed. The setting in <varname>module_nopoison</varname> replaces the value of <varname>nopoison</varname>. If a particular module isn't listed in the dictionary, the global <varname>nopoison</varname> will be used.
el: Ένα λεξικό που αντιστοιχίζει τα ονόματα ενοτήτων σε τιμές Μπουλ. Αν μια ενότητα οριστεί σε <constant>αληθής</constant>, το JHBuild θα προσπαθήσει να δομήσει εξαρτημένες ενότητες ακόμα κι αν η συγκεκριμένη ενότητα αποτύχει. Η ρύθμιση στο <varname>module_nopoison</varname> αντικαθιστά την τιμή του <varname>nopoison</varname>. Αν η συγκεκριμένη ενότητα δεν είναι στη λίστα στο λεξικό, μια καθολική <varname>nopoison</varname> θα χρησιμοποιηθεί.

source: A dictionary mapping module names to dictionaries with extra environment variables to pass when executing commands for the module.
el: Ένα λεξικό που αντιστοιχίζει τα ονόματα ενοτήτων σε λεξικά με τις πρόσθετες μεταβλητές περιβάλλοντος να περνούν όταν εκτελούνται εντολές για την ενότητα.

source: A string specifying the directory containing the modulesets to use. Defaults to the <filename>modulesets/</filename> directory in JHBuild sources.
el: Μια συμβολοσειρά που ορίζει τον κατάλογο που περιέχει τα χρησιμοποιούμενες ομάδες ενοτήτων. Προεπιλογή ο κατάλογος <filename>modulesets/</filename> στις πηγές JHBuild.

source: Run builds under the <constant>SCHED_IDLE</constant> priority on Linux, <command>nice</command> on other Unix. This can dramatically improve desktop interactivity for parallel builds while having only a negligible impact on build throughput.
el: Εκτελεί δομήσεις με προτεραιότητα <constant>SCHED_IDLE</constant> στο Λίνουξ, <command>nice</command> σε άλλα Γιούνιξ. Αυτό μπορεί να βελτιώσει δραματικά την αλληλεπίδραση της επιφάνειας εργασίας για παράλληλες δομήσεις, ενώ έχει μόνο μια αμελητέα επίδραση στην απόδοση δόμησης.

source: A boolean value, if set to <constant>True</constant> JHBuild will not build modules, but just download and unpack the sources. The default vale is <constant>False</constant>.
el: Μια τιμή Μπουλ, αν οριστεί σε <constant>αληθή</constant> το JHBuild δεν θα δομήσει ενότητες, αλλά απλά θα μεταφορτώσει και θα αποσυμπιέσει τις πηγές. Η προεπιλεγμένη τιμή είναι <constant>ψευδής</constant>.

source: A boolean value specifying whether to access the network. This affects checking out or updating CVS modules, downloading tarballs and updating module sets. Setting this to <constant>True</constant> is equivalent to passing the <option>--no-network</option> option. Defaults to <constant>False</constant>.
el: Μια λογική τιμή που ορίζει αν θα προσπελάζετε το δίκτυο. Αυτό επηρεάζει τον έλεγχο εξόδου ή ενημέρωσης των ενοτήτων CVS, μεταφόρτωσης tarballs και ενημέρωσης ομάδων ενοτήτων. Η ρύθμιση αυτού σε <constant>αληθής</constant> είναι ισοδύναμη με το πέρασμα της επιλογής <option>--no-network</option>. Προεπιλογή το <constant>ψευδής</constant>.

source: A boolean value specifying whether to emit notifications using the notification daemon. If set to <constant>False</constant>, notifications are emitted. Defaults to <constant>True</constant>.
el: Μια λογική τιμή που ορίζει αν θα εκπέμπονται ειδοποιήσεις χρησιμοποιώντας τον δαίμονα ειδοποιήσεων. Αν οριστεί σε <constant>ψευδής</constant>, οι ειδοποιήσεις εκπέμπονται. Προεπιλογή το <constant>αληθής</constant>.

source: A boolean value, if set to <constant>True</constant> JHBuild attempts to build modules even if one or more of the module's dependencies failed to build. This option is equivalent to the <option>--no-poison</option> argument. The default value is <constant>False</constant>.
el: Μια λογική τιμή, αν οριστεί σε <constant>αληθής</constant> το JHBuild προσπαθεί να δομήσει τις ενότητες ακόμα κι αν μία ή περισσότερες από τις εξαρτήσεις της ενότητας αποτύχει να δομήσει. Αυτή η επιλογή είναι ισοδύναμη με το όρισμα <option>--no-poison</option>. Η προεπιλεγμένη τιμή είναι <constant>ψευδής</constant>.

source: A boolean value specifying whether to show an icon in the system tray using Zenity. If set to <constant>False</constant>, notifications are emitted. Defaults to <constant>True</constant>.
el: Μια λογική τιμή που ορίζει αν θα εμφανίζεται ένα εικονίδιο στην περιοχή συστήματος χρησιμοποιώντας το Zenity. Αν οριστεί σε <constant>ψευδής</constant>, οι ειδοποιήσεις εκπέμπονται. Προεπιλογή το <constant>αληθής</constant>.

source: A boolean value, if set to <constant>True</constant> JHBuild will run any graphical tests on the real X server, rather than using <command>Xvfb</command>. This option is equivalent to passing <option>--no-xvfb</option>. The default value is <constant>False</constant>
el: Μια λογική τιμή, αν οριστεί σε <constant>αληθής</constant> το JHBuild θα εκτελέσει οποιεσδήποτε γραφικές δοκιμές στον πραγματικό εξυπηρετητή Χ, αντί να χρησιμοποιήσει το <command>Xvfb</command>. Αυτή η επιλογή είναι ισοδύναμη με το πέρασμα του <option>--no-xvfb</option>. Η προεπιλεγμένη τιμή είναι <constant>ψευδής</constant>

source: A boolean value, if set to <constant>True</constant> JHBuild will not build dependency modules if corresponding system packages are installed and sufficient version. Defaults to <constant>True</constant>.
el: Μια λογική τιμή, αν οριστεί σε <constant>αληθή</constant> το JHBuild δεν θα δομήσει ενότητες εξάρτησης αν τα αντίστοιχα πακέτα του συστήματος είναι εγκατεστημένα και επαρκούς έκδοσης. Η προεπιλογή το <constant>αληθής</constant>.

source: A boolean value specifying whether to pretty format the subprocess output. Only CVS output supports pretty printing. Disable if the pretty printing causes problems. Defaults to <literal>True</literal>.
el: Μια λογική τιμή που ορίζει αν θα η έξοδος της υποδιεργασίας θα εμφανιστεί σε επιμελημένη μορφή. Μόνο η έξοδος CVS υποστηρίζει επιμελημένη εκτύπωση. Απενεργοποιήστε αν η επιμελημένη εκτύπωση προκαλεί προβλήματα. Προεπιλογή σε <literal>αληθής</literal>.

source: A string displayed before JHBuild executes a command. <varname>%(command)s</varname> in the string will be replaced with the command about to be executed. <varname>%(cwd)s</varname> in the string will be replaced with the current working directory. Defaults to <literal>'%(command)s'</literal>.
el: Μια εμφανιζόμενη συμβολοσειρά πριν το JHBuild να εκτελέσει μια εντολή. Το <varname>%(command)s</varname> στη συμβολοσειρά θα αντικατασταθεί με την σχετική εντολή εκτέλεσης. <varname>%(cwd)s</varname> στη συμβολοσειρά θα αντικατασταθεί με τον τρέχοντα κατάλογο εργασίας. Προεπιλογή το <literal>'%(command)s'</literal>.

source: A boolean value specifying whether to display a progress bar during <link linkend="cfg-quiet-mode">quiet mode </link>. Defaults to <literal>True</literal>.
el: Μια λογική τιμή που ορίζει αν θα εμφανίζεται μια γραμμή προόδου κατά τη διάρκεια της <link linkend="cfg-quiet-mode">σιωπηρής κατάστασης</link>. Προεπιλογή το <literal>αληθής</literal>.

source: A boolean value, if set to <constant>True</constant> disables the output of running commands. Defaults to <literal>False</literal>.
el: Μια λογική τιμή, αν οριστεί σε <constant>αληθή</constant> απενεργοποιεί την έξοδο των εκτελούμενων εντολών. Προεπιλογή το <literal>ψευδής</literal>.

source: A dictionary specifying an alternative repository location for a particular repository. This configuration variable is useful to a module developer. By default, JHBuild will check out code from repositories using an anonymous repository location. The dictionary keys are short repository names and the values are the alternative repository location strings. For example:
el: Ένα λεξικό που ορίζει μια εναλλακτική τοποθεσία αποθετηρίου για ένα συγκεκριμένο αποθετήριο. Αυτή η μεταβλητή παραμετροποίησης είναι χρήσιμη σε έναν προγραμματιστή ενοτήτων. Από προεπιλογή, το JHBuild θα κατεβάσει τον κώδικα από αποθετήρια χρησιμοποιώντας μια ανώνυμη τοποθεσία αποθετηρίου. Τα κλειδιά του λεξικού είναι σύντομα ονόματα αποθετηρίων και οι τιμές τους είναι συμβολοσειρές εναλλακτικών τοποθεσιών αποθετηρίων. Για παράδειγμα:

source: A list of modules to skip. This <option>--skip</option> command line option extends the list. This list is empty by default. If the list contains the special value <literal>'*'</literal>, JHBuild will skip all modules not explicitly listed in the <varname>modules</varname> variable. This may be useful if you want to build modules without their implicit dependencies.
el: Ένας κατάλογος ενοτήτων προς παράβλεψη. Αυτή η επιλογή <option>--skip</option> της γραμμής εντολών επεκετείνει τη λίστα. Η λίστα είναι κενή από προεπιλογή. Αν η λίστα περιέχει την ειδική τιμή <literal>'*'</literal>, τότε το JHBuild θα προσπεράσει όλες τις ενότητες που δεν συμπεριλαμβάνονται ρητά στη μεταβλητή <varname>modules</varname>. Αυτό μπορεί να είναι χρήσιμο αν θέλετε να δημιουργήσετε ενότητες χωρίς τις ρητές εξαρτήσεις τους.

source: A string if set, and if supported by the underlying version control system, JHBuild will update the source tree to the specified date before building. An ISO date format is required, e.g. <literal>'<replaceable>yyyy</replaceable>-<replaceable>mm</replaceable>-<replaceable>dd</replaceable>'</literal>. Defaults to <constant>None</constant>.
el: Εάν οριστεί μια συμβολοσειρά και αν υποστηρίζεται από την υποκείμενη έκδοση του συστήματος ελέγχου, το JHBuild θα ενημερώσει το πηγαίο δένδρο στη καθορισμένη ημερομηνία πριν τη δόμηση. Απαιτείται μια μορφή ημερομηνίας ISO, π.χ. <literal>'<replaceable>yyyy</replaceable>-<replaceable>mm</replaceable>-<replaceable>dd</replaceable>'</literal>. Προεπιλογή σε <constant>Καμία</constant>.

source: A string specifying which program to use for subversion support. This can be <literal>svn</literal>, <literal>git-svn</literal> or <literal>bzr</literal>. Defaults to <literal>svn</literal>.
el: Μια συμβολοσειρά που ορίζει ποιο πρόγραμμα θα χρησιμοποιηθεί για υποστήριξη subversion. Αυτό μπορεί να είναι <literal>svn</literal>, <literal>git-svn</literal> ή <literal>bzr</literal>. Προεπιλογή το <literal>svn</literal>.

source: A string if set, tarballs will be downloaded to the specified directory instead of <varname>checkoutroot</varname>. This is useful if you have multiple JHBuild environments or regularly clear out <varname>checkoutroot</varname> and want to reduce bandwidth usage.
el: Αν οριστεί μια συμβολοσειρά, τα tarballs θα μεταφορτωθούν στον καθορισμένο κατάλογο αντί για το <varname>checkoutroot</varname>. Αυτό είναι χρήσιμο αν έχετε πολλαπλά περιβάλλοντα JHBuild ή καθαρίσετε τακτικά το <varname>checkoutroot</varname> και θέλετε να μειώσετε τη χρήση πλάτους ζώνης.

source: <_:simpara-1/> Defaults to <literal>'~/jhbuild/downloads'</literal>.
el: <_:simpara-1/> Από προεπιλογή, επιστρέφει στο <literal>'~/jhbuild/downloads'</literal>.

source: A string specifying the directory to store <command>jhbuild tinderbox</command> output. This string can be overridden by the <option>--output</option> option. Defaults to <constant>None</constant>, so either the command line option must be used or this variable must be set in the configuration file.
el: Μια συμβολοσειρά που ορίζει τον κατάλογο αποθήκευσης της εξόδου <command>jhbuild tinderbox</command>. Αυτή η συμβολοσειρά μπορεί να αντικατασταθεί από την επιλογή <option>--output</option>. Προεπιλογή το <constant>Καμία</constant>, έτσι είτε η επιλογή γραμμής εντολών πρέπει να χρησιμοποιηθεί ή αυτή η μεταβλητή πρέπει να οριστεί στο αρχείο ρυθμίσεων.

source: A boolean value, if set to <constant>True</constant> JHBuild will automatically try to solve failures by 1) running <command>autogen.sh</command> again, and 2) checking out a newer version of a module from version control. This setting is equivalent to passing the <option>--try-checkout</option> option.
el: Μια λογική τιμή, αν οριστεί σε <constant>αληθή</constant> το JHBuild θα προσπαθήσει αυτόματα να επιλύσει τις αποτυχίες 1) εκτελώντας το <command>autogen.sh</command> ξανά και 2) ελέγχοντας την έξοδο μιας νεότερης έκδοσης μιας ενότητας από τον έλεγχο της έκδοσης. Αυτή η ρύθμιση είναι ισοδύναμη με το πέρασμα της επιλογής <option>--try-checkout</option>.

source: A boolean value that specifies whether to install libraries to <filename>lib64</filename> directories. If set, <literal>--libdir=\${exec_prefix}/lib64</literal> will be passed to configure. Defaults to <constant>True</constant> if running on <literal>x86_64</literal>, <literal>ppc64</literal> or <literal>s390x</literal> Linux, and <constant>False</constant> on other systems.
el: Μια λογική τιμή που καθορίζει αν θα εγκατασταθούν βιβλιοθήκες στους καταλόγους <filename>lib64</filename>. Αν οριστεί, το <literal>--libdir=\${exec_prefix}/lib64</literal> θα περαστεί στη διαμόρφωση. Προεπιλογή το <constant>αληθής</constant> αν τρέχει σε <literal>x86_64</literal>, <literal>ppc64</literal> ή <literal>s390x</literal> σε Λίνουξ και <constant>ψευδής</constant> σε άλλα συστήματα.

source: A boolean value that specifies to use modulesets that were checked out along the JHBuild source code; instead of downloading them on-the-fly from GNOME version control system. Defaults to <constant>False</constant>.
el: Μια λογική τιμή που καθορίζει τη χρήση ομάδων ενοτήτων που ελέγχθηκαν μαζί με τον πηγαίο κώδικα του JHBuild· αντί για μεταφόρτωση τους απευθείας από το σύστημα ελέγχου έκδοσης του GNOME. Προεπιλογή το <constant>ψευδής</constant>.

source: A string listing arguments to pass to <command>Xvfb</command> if running graphical tests.
el: Μια συμβολοσειρά που εμφανίζει τα ορίσματα που θα περαστούν στο <command>Xvfb</command> εάν εκτελούνται γραφικές δοκιμές.

source: <varname>conditions</varname>
el: <varname>notrayicon</varname>
