Repository: CrandellWS/jhbuild
Catalog: doc/*/*.po
Languages: el

source: <filename>libpng</filename>, <filename>libjpeg</filename> and <filename>libtiff</filename> (used for image loading).
el: Τα <filename>libpng</filename>, <filename>libjpeg</filename> και <filename>libtiff</filename> (που χρησιμοποιούνται για τη φόρτωση εικόνας).

source: If installing distribution packages, and if applicable for your distribution, install the corresponding <quote>dev</quote> or <quote>devel</quote> packages. A list of <ulink url="http://live.gnome.org/JhbuildDependencies">package names</ulink> for different distributions is maintained on the GNOME wiki.
el: Εάν εγκαταστήσετε τα πακέτα διανομής -και είναι δυνατό για τη διανομή σας-, εγκαταστήστε τα αντίστοιχα πακέτα <quote>dev</quote> ή <quote>devel</quote>. Μια λίστα των <ulink url="http://live.gnome.org/JhbuildDependencies">ονομάτων πακέτων</ulink> για διαφορετικές διανομές συντηρείται στο βίκι GNOME.

source: Running a Single GNOME Application
el: Εκτέλεση μιας μοναδικής εφαρμογής GNOME

source: This section details how to run a single GNOME application. The application will run within the current desktop environment. To run the application within the complete JHBuild GNOME see <xref linkend="running-gnome"/>.
el: Αυτή η ενότητα δίνει λεπτομέρειες για την εκτέλεση μιας μοναδικής εφαρμογής GNOME. Η εφαρμογή θα τρέξει μέσα στο τρέχον περιβάλλον της επιφάνειας εργασίας. Για να τρέξετε την εφαρμογή στο πλήρες JHBuild GNOME δείτε <xref linkend="running-gnome"/>.

source: Launch a JHBuild shell. The JHBuild shell has all the necessary environment variables set.
el: Ξεκινήστε ένα κέλυφος JHBuild. Το κέλυφος JHBuild έχει ορίσει όλες τις απαραίτητες μεταβλητές περιβάλλοντος.

source: Verify the correct application will be run. For example:
el: Επιβεβαιώστε ότι θα εκτελεστεί η σωστή εφαρμογή. Για παράδειγμα:

source: Run the application:
el: Εκτέλεση της εφαρμογής:

source: Alternatively, run the application using the <command>run</command> command:
el: Για να λάβετε πληροφορίες για μια συγκεκριμένη ενότητα, χρησιμοποιήστε την εντολή <command>info</command>:

source: Running the GNOME Desktop Environment
el: Τρέχοντας το περιβάλλον επιφάνειας εργασίας GNOME

source: Create a new user account to run the JHBuild GNOME. Running JHBuild GNOME using different user account is recommended to avoid problems caused by user settings stored in the home directory. This manual refers to the new account as <systemitem class="username">gnomedev</systemitem>.
el: Δημιουργήστε έναν νέο λογαριασμό χρήστη για εκτέλεση του JHBuild GNOME. Η εκτέλεση του JHBuild GNOME χρησιμοποιώντας διαφορετικό λογαριασμό χρήστη συνιστάται για αποφυγή προβλημάτων που προκαλούνται από αποθηκευμένες ρυθμίσεις χρήστη στον προσωπικό κατάλογο. Αυτό το εγχειρίδιο αναφέρεται στον νέο λογαριασμό ως <systemitem class="username">gnomedev</systemitem>.

source: Setup JHBuild on the new <systemitem class="username">gnomedev</systemitem> account. Copy or soft-link <filename>~/.config/jhbuildrc</filename> and <filename>~/.local/bin/jhbuild</filename> to <systemitem class="username">gnomedev</systemitem> home directory.
el: Εγκατάσταση του JHBuild στον νέο λογαριασμό <systemitem class="username">gnomedev</systemitem>. Αντιγραφή ή συμβολικοός δεσμός των <filename>~/.config/jhbuildrc</filename> και <filename>~/.local/bin/jhbuild</filename> στον προσωπικό κατάλογο <systemitem class="username">gnomedev</systemitem>.

source: Open a terminal as the user <systemitem class="username">gnomedev</systemitem>. Permanently add <filename>~/.local/bin</filename> to the <envar>PATH</envar> variable, run the following command:
el: Ανοίξτε ένα τερματικό ως ο χρήστης <systemitem class="username">gnomedev</systemitem>. Για να προσθέσετε μόνιμα το <filename>~/.local/bin</filename> στη μεταβλητή <envar>PATH</envar>, εκτελέστε την ακόλουθη εντολή:

source: Test JHBuild works:
el: Δοκιμή εργασίας του JHBuild:

source: Setup GNOME to run from the display manager
el: Ρύθμιση του GNOME για εκτέλεση από τον διαχειριστή εμφάνισης

source: Build and install JHBuild GNOME.
el: Δόμηση και εγκατάσταση του JHBuild GNOME.

source: Enable system services. JHBuild GNOME will use the <filename>/usr/bin</filename> system <application>D-Bus</application> daemon and the system services within <filename>/usr/share/dbus-1/system-services/</filename>. JHBuild GNOME will use the JHBuild session <application>D-Bus</application> daemon and the services within <filename><replaceable>~/jhbuild/install/</replaceable>/share/dbus-1/services/</filename>. Replace <filename>~/jhbuild/install</filename> with GNOME install <varname>prefix</varname> in the command below:
el: Ενεργοποίηση υπηρεσιών συστήματος. Το JHBuild GNOME θα χρησιμοποιήσει το σύστημα <filename>/usr/bin</filename> του δαίμονα <application>D-Bus</application> και τις υπηρεσίες συστήματος μέσα στο <filename>/usr/share/dbus-1/system-services/</filename>. Το JHBuild GNOME θα χρησιμοποιήσει τη συνεδρία JHBuild του δαίμονα <application>D-Bus</application> και τις υπηρεσίες μέσα στο <filename><replaceable>/opt/gnome</replaceable>/share/dbus-1/services/</filename>. Αντικαταστήστε το <filename>/opt/gnome</filename> με την εγκατάσταση του GNOME <varname>prefix</varname> στην παρακάτω εντολή:

source: <prompt>$ </prompt><userinput>rm -rf <replaceable>~/jhbuild/install</replaceable>/var/run/dbus</userinput> <prompt>$ </prompt><userinput>ln -s /var/run/dbus <replaceable>~/jhbuild/install</replaceable>/var/run/dbus</userinput> <prompt>$ </prompt><userinput>rm -rf <replaceable>~/jhbuild/install</replaceable>/var/lib/dbus/machine-id</userinput> <prompt>$ </prompt><userinput>ln -s /var/lib/dbus/machine-id <replaceable>~/jhbuild/install</replaceable>/var/lib/dbus/machine-id</userinput>
el: <prompt>$ </prompt><userinput>rm -rf <replaceable>/opt/gnome</replaceable>/var/run/dbus</userinput> <prompt>$ </prompt><userinput>ln -s /var/run/dbus <replaceable>/opt/gnome</replaceable>/var/run/dbus</userinput> <prompt>$ </prompt><userinput>rm -rf <replaceable>/opt/gnome</replaceable>/var/lib/dbus/machine-id</userinput> <prompt>$ </prompt><userinput>ln -s /var/lib/dbus/machine-id <replaceable>/opt/gnome</replaceable>/var/lib/dbus/machine-id</userinput>

source: Create a GNOME startup script at <filename>/usr/bin/gnome-jhbuild-session</filename> with the following, replacing <filename>~/jhbuild/install</filename> with GNOME install <varname>prefix</varname>:
el: Δημιουργήστε ένα σενάριο εκκίνησης του GNOME στο <filename>/usr/bin/gnome-jhbuild-session</filename> με το εξης, αντικαθιστώντας το <filename>/opt/gnome</filename> με την εγκατάσταση GNOME <varname>prefix</varname>:

source: #!/bin/sh GNOME=<replaceable>~/jhbuild/install</replaceable> GDK_USE_XFT=1 XDG_DATA_DIRS=$XDG_DATA_DIRS:$GNOME/share XDG_CONFIG_DIRS=$XDG_CONFIG_DIRS:$GNOME/etc/xdg jhbuild run gnome-session
el: #!/bin/sh GNOME=<replaceable>/opt/gnome</replaceable> GDK_USE_XFT=1 XDG_DATA_DIRS=$XDG_DATA_DIRS:$GNOME/share XDG_CONFIG_DIRS=$XDG_CONFIG_DIRS:$GNOME/etc/xdg jhbuild run gnome-session

source: Make the file <filename>/usr/bin/gnome-jhbuild-session</filename> executable:
el: Κάντε το αρχείο <filename>/usr/bin/gnome-jhbuild-session</filename> εκτελέσιμο:

source: To add a new session entry in the display manager, create <filename>/usr/share/xsessions/gnome-jhbuild.desktop</filename> and enter:
el: Για να προσθέσετε μια νέα καταχώριση συνεδρίας στον διαχειριστή εμφάνισης, δημιουργήστε το <filename>/usr/share/xsessions/gnome-jhbuild.desktop</filename> και εισάγετε:

source: Restart <command>gdm</command>.
el: Επανεκκίνηση του <command>gdm</command>.

source: Running GNOME from the display manager
el: Εκτέλεση του GNOME από τον διαχειριστή εμφάνισης

source: To run the JHBuild GNOME, select the GNOME (JHBuild) session at the display manager before entering <systemitem class="username">gnomedev</systemitem> login credentials. If successful, JHBuild GNOME will be displayed. If unsuccessful, check the log file. The log file will be located at <filename>~gnomedev/.cache/gdm/session.log</filename> or <filename>~gnomedev/.xsession-errors</filename>.
el: Για να τρέξετε το JHBuild GNOME, επιλέξτε τη συνεδρία GNOME (JHBuild) στον διαχειριστή εμφάνισης πριν την είσοδο των διαπιστευτηρίων σύνδεσης του <systemitem class="username">gnomedev</systemitem>. Αν είναι πετυχημένο, το JHBuild GNOME θα εμφανιστεί. Εάν είναι αποτυχημένο, σημειώστε το αρχείο καταγραφής. Το αρχείο καταγραφής θα εντοπιστεί στο <filename>~gnomedev/.cache/gdm/session.log</filename> ή στο <filename>~gnomedev/.xsession-errors</filename>.

source: Buildbot Integration
el: Ενσωμάτωση στο Buildbot

source: Coupled with the <ulink url="http://buildbot.net">Buildbot</ulink> project, JHBuild can also function as a continuous integration tool. The Buildbot configuration is used by the GNOME project at <ulink url="http://build.gnome.org">build.gnome.org</ulink>.
el: Συνδυασμένο με το έργο <ulink url="http://buildbot.net">Buildbot</ulink>, το JHBuild μπορεί επίσης να λειτουργήσει ως ένα συνεχές εργαλείο ενσωμάτωσης. Η ρύθμιση Buildbot χρησιμοποιείται από το έργο GNOME στο <ulink url="http://build.gnome.org">build.gnome.org</ulink>.

source: Configuring a Buildbot Slave
el: Ρύθμιση ενός υποτελούς Buildbot

source: A Buildbot slave is a variation of a normal JHBuild installation that serves the requests of a Buildbot master. It is recommended to set up JHBuild and complete a build with most modules building successfully before adding the Buildbot customizations.
el: Ένα υποτελές Buildbot είναι μια παραλλαγή μιας κανονικής εγκατάστασης του JHBuild που εξυπηρετεί τα αιτήματα του κύριου Buildbot. Συνιστάται η ρύθμιση του JHBuild και η ολοκλήρωση μιας δόμησης με τις περισσότερες ενότητες δόμησης με επιτυχία, πριν την προσθήκη των προσαρμογών του Buildbot.

source: Buildbot commands are options to the <command>bot</command> command. To download and install the extra required software, run the following command:
el: Οι εντολές του Buildbot είναι επιλογές στην εντολή <command>bot</command>. Για την λήψη και εγκατάσταση του πρόσθετου απαιτούμενου λογισμικού, εκτελέστε την παρακάτω εντολή:

source: Once this step has completed successfully, three new configuration variables are required in <filename>~/.config/jhbuildrc</filename>.
el: Μόλις ολοκληρωθεί αυτό το βήμα με επιτυχία, απαιτούνται τρεις νέες μεταβλητές διαμόρφωσης στο <filename>~/.config/jhbuildrc</filename>.

source: It is not possible to use an alternate configuration file, the <link linkend="option-file"><option>--file</option></link> will not get desired effects.
el: Δεν είναι δυνατό να χρησιμοποιήσετε ένα εναλλακτικό αρχείο ρυθμίσεων, το <link linkend="option-file"><option>--file</option></link> δεν θα δώσει τα επιθυμητά αποτελέσματα.

source: <varname>jhbuildbot_master</varname> is a string specifying the Buildbot master server; it defaults to <literal>'build.gnome.org:9070'</literal>. <varname>jhbuildbot_slavename</varname> and <varname>jhbuildbot_password</varname> identify the slave on the master server. Contact the Buildbot master administrators to obtain the slave name and password.
el: Το <varname>jhbuildbot_master</varname> είναι μια συμβολοσειρά που ορίζει τον εξυπηρετητή του κύριου Buildbot· η προεπιλογή είναι για <literal>'build.gnome.org:9070'</literal>. <varname>jhbuildbot_slavename</varname> και <varname>jhbuildbot_password</varname> ταυτοποίηση του υποτελούς στον κύριο εξυπηρετητή. Επικοινωνήστε με τους διαχειριστές του κύριου Buildbot για να πάρετε το όνομα του υποτελούς και τον κωδικό.

source: The administrators of <ulink url="http://build.gnome.org">build.gnome.org</ulink> can be reached on the <ulink url="mailto:build-brigade-list@gnome.org">Build Brigade mailing list</ulink>.
el: Μπορείτε να επικοινωνήσετε με τους διαχειριστές του <ulink url="http://build.gnome.org">build.gnome.org</ulink> στο <ulink url="mailto:build-brigade-list@gnome.org">Build Brigade mailing list</ulink>.

source: Command Reference
el: Αναφορά εντολής

source: JHBuild uses a command line syntax similar to tools like CVS:
el: Το JHBuild χρησιμοποιεί μια γραμμή εντολών με σύνταξη παρόμοια με εργαλεία όπως CVS:

source: The global JHBuild options are:
el: Οι καθολικές επιλογές του JHBuild είναι:

source: Use an alternative configuration file instead of the default <filename>~/.config/jhbuildrc</filename>.
el: Χρησιμοποιήστε ένα εναλλακτικό αρχείο ρυθμίσεων αντί για το προεπιλεγμένο <filename>~/.config/jhbuildrc</filename>.

source: Use a module set other than the module set listed in the configuration file. This option can be a relative path if the module set is located in the JHBuild moduleset folder, or an absolute path if located elsewhere.
el: Χρησιμοποιήστε μια ομάδα ενοτήτων άλλη από την ομάδα ενοτήτων που καταχωρίζεται στο αρχείο ρυθμίσεων. Αυτή η επιλογή μπορεί να είναι μια σχετική διαδρομή αν η ομάδα ενοτήτων είναι τοποθετημένο στον φάκελο ομάδας ενοτήτων, ή σε μια απόλυτη διαδρομή αν είναι τοποθετημένο αλλού.

source: Do not prompt the user for any input. This option is useful if leaving a build unattended, in order to ensure the build is not interrupted.
el: Να μην ζητάτε από τον χρήστη καμία καταχώριση. Αυτή η επιλογή είναι χρήσιμη εάν αφήνετε μια αφύλακτη δόμηση, για να βεβαιωθείτε ότι η δόμηση δεν διακόπηκε.

source: Modify the condition flags to be different than those determined on the basis of the OS and those specified in jhbuildrc. Modifications are specified like <literal>-wayland</literal> or <literal>+docs</literal> in order to remove or add conditions. Multiple modifications can be separated by a comma like <command>--conditions=+docs,-wayland</command> or you can split them across multiple <command>--conditions</command> arguments.
el: Τροποιήστε τις σημαίες κατάστασης ώστε να είναι διαφορετικές από εκείνες που καθορίζονται με βάση το λειτουργικό σύστημα και από εκείνες που ορίζονται στο jhbuildrc. Οι τροποποιήσεις ορίζονται ως <literal>-wayland</literal> ή ως <literal>+docs</literal> ούτως ώστε να απομακρύνονται ή να προστίθενται καταστάσεις. Πολλαπλές τροποποιήσεις μπορούν να διαχωρίζονται με ένα κόμμα, όπως <command>--conditions=+docs,-wayland</command> ή μπορείτε να τις ξεχωρίσετε με τη βοήθεια πολλαπλών <command>--conditions</command> ορισμάτων.

source: Command specific options are listed below.
el: Οι ειδικές επιλογές εντολής καταχωρίζονται παρακάτω.

source: autobuild
el: αυτόματη δόμηση

source: The <command>autobuild</command> command automatically builds the modules as specified in the configuration file, and then upload the results to JhAutobuild.
el: Η εντολή <command>autobuild</command> δομεί αυτόματα τις ενότητες όπως ορίζονται στο αρχείο ρυθμίσεων και έπειτα ανεβάζει τα αποτελέσματα στο JhAutobuild.

source: The <option>--autogen</option>, <option>--clean</option>, <option>--distcheck</option>, <option>--skip</option> and <option>--start-at</option> options are processed as per the <link linkend="command-reference-build"><command>build</command></link> command.
el: Οι επιλογές <option>--autogen</option>, <option>--clean</option>, <option>--distcheck</option>, <option>--skip</option> και <option>--start-at</option> επεξεργάζονται ανά εντολή <link linkend="command-reference-build"><command>build</command></link>.

source: This option specifies the JhAutobuild URL to report to.
el: Αυτή η επιλογή καθορίζει το URL υου JhAutobuild για αναφορά.

source: If specified, JHBuild's output will be more verbose.
el: Αν οριστεί, η έξοδος του JHBuild θα είναι πιο αναλυτική.

source: bootstrap
el: εκκινητής

source: The <command>bootstrap</command> command installs a set of build utilities. The build utilities include <application>autoconf</application>, <application>automake</application> and similar utilities. The recommended method to install the build utilities is via your distribution's package management system. The <command>bootstrap</command> should only be used if the build utilities are not provided by your distribution's package management system, for example on <systemitem class="osname">Mac OS</systemitem>.
el: Η εντολή <command>bootstrap</command> εγκαθιστά μια ομάδα βοηθημάτων δόμησης. Τα βοηθήματα δόμησης περιλαμβάνουν <application>autoconf</application>, <application>automake</application> και παρόμοια βοηθήματα. Η συνιστώμενη μέθοδος εγκατάστασης των βοηθημάτων δόμησης είναι μέσα από το σύστημα διαχείρισης πακέτων της διανομής σας. Το <command>bootstrap</command> πρέπει να χρησιμοποιηθεί μόνο αν οι βοηθήματα δόμησης δεν παρέχονται από το σύστημα διαχείρισης πακέτων της διανομής σας, για παράδειγμα στο <systemitem class="osname">Mac OS</systemitem>.

source: The <command>bootstrap</command> command builds modules using the same method as the <command>build</command> command, but uses the <filename>bootstrap.modules</filename> moduleset.
el: Η εντολή <command>bootstrap</command> δομεί ενότητες χρησιμοποιώντας την ίδια μέθοδο όπως η εντολή <command>build</command>, αλλά χρησιμοποιεί την ομάδα ενοτήτων <filename>bootstrap.modules</filename>.

source: See the <link linkend="command-reference-build"><command>build</command></link> command documentation for available options.
el: Δείτε την τεκμηρίωση της εντολής <link linkend="command-reference-build"><command>build</command></link> για διαθέσιμες επιλογές.

source: build
el: δόμηση

source: The <command>build</command> command builds one or more packages, including their dependencies.
el: Η εντολή <command>build</command> δομεί ένα ή περισσότερα πακέτα, συμπεριλαμβάνοντας τις εξαρτήσεις τους.

source: If no module names are provided on the command line, the <link linkend="cfg-modules">modules</link> list from the configuration file will be used.
el: Εάν δεν παρέχονται ονόματα ενοτήτων στη γραμμή εντολών, θα χρησιμοποιηθείη λίστα <link linkend="cfg-modules">ενότητες</link> από το αρχείο ρυθμίσεων.

source: Always run <command>autogen.sh</command> before building modules.
el: Να εκτελείτε πάντα το <command>autogen.sh</command> πριν τη δόμηση ενοτήτων.

source: Run <command>make clean</command> before building modules.
el: Να εκτελείτε το <command>make clean</command> πριν τη δόμηση ενοτήτων.

source: Run <command>make check</command> after building modules.
el: Να εκτελείτε το <command>make check</command> μετά τη δόμηση ενοτήτων.

source: Run <command>make dist</command> after building modules.
el: Να εκτελείτε το <command>make dist</command> μετά τη δόμηση ενοτήτων.

source: Run <command>make distcheck</command> after building modules.
el: Να εκτελείτε το <command>make distcheck</command> μετά τη δόμηση ενοτήτων.

source: For git modules, run <command>git clean -dfx</command> before building modules. For other modules, run <command>make distclean</command> before building modules.
el: Για ενότητες git, να εκτελείτε <command>git clean -dfx</command> πριν τη δόμηση ενοτήτων. Για άλλες ενότητες, να εκτελείτε <command>make distclean</command> πριν τη δόμηση ενοτήτων.

source: This option will delete any uncommited changes.
el: Αυτή η επιλογή θα διαγράψει οποιεσδήποτε ανυπόβλητες αλλαγές.

source: Do not build soft dependencies.
el: Να μην δομείτε απαλές εξαρτήσεις.

source: Do not access the network when building modules. This will skip download or update stages in a build. If a module can't be built without network access, the module build will fail.
el: Μην προσπελάζετε το δίκτυο κατά τη δόμηση ενοτήτων. Αυτό θα παραλείψει τη λήψη ή την ενημέρωση σταδίων σε μια δόμηση. Αν μία ενότητα δεν μπορεί να δομηθεί χωρίς πρόσβαση δικτύου, η δόμηση της ενότητας θα αποτύχει.

source: Do not build the listed modules. Used to skip the building of specified dependencies.
el: Μην δομείτε τις καταχωρισμένες ενότητες. Χρησιμοποιούνται για να αποφύγουν τη δόμηση συγκεκριμένων εξαρτήσεων.

source: Ignore modules that do not match <replaceable>tag</replaceable>. Modules are automatically attributed a tag matching the name of the module's module set.
el: Αγνοήστε ενότητες που δεν ταιριάζουν με <replaceable>ετικέτες</replaceable>. Οι ενότητες αποδίδουν αυτόματα μια ετικέτα που ταιριάζει στο όνομα μιας ομάδας ενοτήτων της ενότητας.

source: Start at the named module rather than at the beginning of the list. This option is useful if the build was interrupted.
el: Ξεκινήστε με την επώνυμη ενότητα αντί να ξεκινήσετε με τη λίστα. Αυτή η επιλογή είναι χρήσιμη αν η δόμηση διακόπηκε.

source: If supported by the underlying version control system, update the source tree to the specified date before building. An ISO date format is required, e.g. <literal>"2009-09-18 02:32Z"</literal>.
el: Εάν υποστηρίζεται από το υποκείμενο σύστημα ελέγχου έκδοσης, ενημερώστε το πηγαίο δένδρο στα συγκεκριμένα δεδομένα πριν τη δόμηση. Απαιτείται μια μορφή ημερομηνίας ISO, π.χ. <literal>"2009-09-18 02:32Z"</literal>.

source: Run graphical tests on the actual X server rather than in a simulated Xvfb.
el: Εκτελέστε δοκιμές γραφικών στον ενεργό εξυπηρετητή Χ αντί για τον προσομοιωμένο Xvfb.

source: If the build fails, and if supported by the version control system, force a checkout and run <command>autogen.sh</command> before retrying the build.
el: Εάν η δόμηση αποτύχει και αν υποστηρίζεται το σύστημα ελέγχου έκδοσης, πάρτε ένα αντίγραφο εργασίας και εκτελέστε το <command>autogen.sh</command> πριν ξαναδοκιμάσετε τη δόμηση.

source: If one or more of a module's dependencies failed, this option forces JHBuild to try to build the module anyway.
el: Εάν μία ή περισσότερες εξαρτήσεις της ενότητας αποτύχουν, αυτή η επιλογή εξαναγκάζει το JHBuild να δοκιμάσει να δομήσει την ενότητα οπωσδήποτε.

source: Build the modules even if policy states it is not required.
el: Δομήστε τις ενότητες ακόμα κι αν η πολιτική δηλώνει ότι δεν απαιτείται.

source: Modules listed as optional dependencies, may not be required to build the module. This option forces JHBuild to build optional dependencies.
el: Οι καταχωρισμένες ενότητες ως προαιρετικές εξαρτήσεις, ίσως να μην απαιτούνται για τη δόμηση της ενότητας. Αυτή η επιλογή εξαναγκάζει το JHBuild να δομήσει προαιρετικές εξαρτήσεις.

source: Skip modules installed more recently than the specified relative time. The <replaceable>time</replaceable> string format is a number followed by a unit. The following units are supported: seconds (s), minutes (m), hours (h) and days (d). For example, <option>--min-age=2h</option> will skip modules built less than two hours ago.
el: Παραλείψτε τις ενότητες που εγκαταστάθηκαν πιο πρόσφατα από τον καθορισμένο σχετικό χρόνο. Η μορφή συμβολοσειράς <replaceable>time</replaceable> είναι ένας αριθμός ακολουθούμενος από μια μονάδα. Υποστηρίζονται οι ακόλουθες μονάδες: δευτερόλεπτα (s), λεπτά (m), ώρες (h) και ημέρες (d). Για παράδειγμα, το <option>--min-age=2h</option> θα παραλείψει τις ενότητες που δομήθηκαν σε λιγότερο από δύο ώρες πριν.

source: Ignore missing system dependencies. To ignore a single system dependency add the module to <link linkend="cfg-skip"><varname>skip</varname></link>.
el: Αγνοήστε τις εξαρτήσεις του συστήματος που λείπουν. Για να αγνοήσετε μια μεμονωμένη εξάρτηση του συστήματος προσθέστε την ενότητα στο <link linkend="cfg-skip"><varname>skip</varname></link>.

source: The <command>make</command> command is for actively developing on a particular module. It requires the current directory be a source checkout, and does the equivalent of <command>buildone -nf $(basename $(pwd))</command>.
el: Η εντολή <command>make</command> είναι για ενεργή ανάπτυξη σε μια ειδική ενότητα. Απαιτεί ο τρέχων κατάλογος να είναι ένα αντίγραφο εργασίας πηγής και κάνει το ισοδύναμο του <command>buildone -nf $(basename $(pwd))</command>.

source: The options are the same as those available for the <link linkend="command-reference-build"><command>buildone</command></link> command.
el: Οι επιλογές είναι οι ίδιες με τις διαθέσιμες για την εντολή <link linkend="command-reference-build"><command>buildone</command></link>.
