Repository: CrandellWS/jhbuild
Catalog: doc/*/*.po
Languages: el

source: The <command>buildone</command> command is similar to <command>build</command>, but it does not build the dependent modules. It is useful for rebuilding one or more modules.
el: Η εντολή <command>buildone</command> είναι παρόμοια με την <command>build</command>, αλλά δεν δομεί τις εξαρτημένες ενότητες. Είναι χρήσιμη για την αναδόμηση μιας ή περισσότερων ενοτήτων.

source: The <option>--autogen</option>, <option>--check</option>, <option>--clean</option>, <option>-d</option>, <option>--distcheck</option>, <option>--distclean</option>, <option>--no-network</option>, <option>-D</option>, <option>-x</option> and <option>--nodeps</option> options are processed as per the <link linkend="command-reference-build"><command>build</command></link> command.
el: Οι επιλογές <option>--autogen</option>, <option>--check</option>, <option>--clean</option>, <option>-d</option>, <option>--distcheck</option>, <option>--distclean</option>, <option>--no-network</option>, <option>-D</option>, <option>-x</option> και <option>--nodeps</option> επεξεργάζονται όπως η εντολή <link linkend="command-reference-build"><command>build</command></link>.

source: At least one module must be listed on the command line.
el: Τουλάχιστον μια ενότητα πρέπει να είναι καταχωρισμένη στη γραμμή εντολών.

source: The <command>checkbranches</command> checks the module's branches are defined correctly within the version control system and the branches are consistent with the module set.
el: Η εντολή <command>checkbranches</command> ελέγχει τους κλάδους της ενότητας που ορίζονται σωστά μέσα στο σύστημα ελέγχου της έκδοσης και οι κλάδοι είναι συνεπείς με την ομάδα ενοτήτων.

source: The branch to check.
el: Ο κλάδος προς έλεγχο.

source: The <command>clean</command> command cleans the build directories of one or more modules.
el: Η εντολή <command>clean</command> καθαρίζει τους καταλόγους δόμησης ενός ή περισσότερων ενοτήτων.

source: See the <link linkend="command-reference-build"><command>build</command></link> command documentation for a description of available options.
el: Δείτε την τεκμηρίωση της εντολής <link linkend="command-reference-build"><command>build</command></link> για μια περιγραφή των διαθέσιμων επιλογών.

source: The <command>dot</command> command generates a file describing the directed graph formed by the dependencies between a set of modules. This file can then be processed using the <ulink url="http://www.graphviz.org/">GraphViz</ulink> software to produce a diagram.
el: Η εντολή <command>dot</command> παράγει ένα αρχείο που περιγράφει το κατευθυνόμενο γράφημα που σχηματίστηκε από τις εξαρτήσεις μεταξύ μιας ομάδας ενοτήτων. Αυτό το αρχείο μπορεί τότε να επεξεργαστεί χρησιμοποιώντας το λογισμικό <ulink url="http://www.graphviz.org/">GraphViz</ulink> για να παραχθεί ένα διάγραμμα.

source: The <option>--soft-deps</option> option adds dotted lines from the modules to the soft dependencies. The <option>--clusters</option> option groups modules from <link linkend="moduleset-syntax-defs-metamodule">metamodules</link> together.
el: Η επιλογή <option>--soft-deps</option> προσθέτει διάστικτες γραμμές από τις ενότητες στις μαλακές εξαρτήσεις. Η επιλογή <option>--clusters</option> ομαδοποιεί τις ενότητες από το <link linkend="moduleset-syntax-defs-metamodule">metamodules</link> μαζί.

source: The output of the dot command can be piped to the dot utility to generate a PostScript file:
el: Η έξοδος της εντολής dot μπορεί να μεταφερθεί στο εργαλείο dot για τη δημιουργία αρχείου PostScript:

source: Or a PNG image:
el: Ή μια εικόνα PNG:

source: Sample JHBuild dot output
el: Δείγμα εξόδου JHBuild dot

source: gui
el: γραφική διεπαφή χρήστη

source: The <command>gui</command> command starts a graphical interface to JHBuild which can be used to select modules to build and change some options.
el: Η εντολή <command>gui</command> ξεκινά μια γραφική διεπαφή στο JHBuild που μπορεί να χρησιμοποιηθεί για επιλογή ενοτήτων στη δόμηση και αλλαγή μερικών επιλογών.

source: The graphical interface is rendered using GTK, so extra support libraries are required.
el: Η γραφικό διεπαφή αποδίδεται χρησιμοποιώντας GTK, έτσι πρόσθετες βιβλιοθήκες υποστήριξης απαιτούνται.

source: info
el: πληροφορίες

source: The <command>info</command> command displays information about one or more modules.
el: Η εντολή <command>info</command> εμφανίζει πληροφορίες για μία ή περισσότερες ενότητες.

source: The command displays the module name, type, dependencies, dependent packages, the source directory, and the time it was last installed with JHBuild. If available, information specific to the module type such as the CVS repository or download URL will also be displayed.
el: Η εντολή εμφανίζει το όνομα ενότητας, τύπο, εξαρτήσεις, εξαρτημένα πακέτα, τον πηγαίο κατάλογο και τον χρόνο που εγκαταστάθηκε τελευταία με JHBuild. Εάν υπάρχουν διαθέσιμες, ειδικές πληροφορίες για τον τύπο του αρθρώματος όπως το αποθετήριο CVS ή το URL λήψης θα εμφανιστούν επίσης.

source: If there is no module specified the command will display information about all the modules defined in the module set.
el: Αν δεν υπάρχει συγκεκριμένη ενότητα η εντολή θα εμφανίσει πληροφορίες σχετικά με όλες τις ενότητες που ορίστηκαν στην ομάδα ενοτήτων.

source: list
el: λίστα

source: The <command>list</command> command displays the expanded list of modules the <command>build</command> command would build.
el: Η εντολή <command>list</command> εμφανίζει την εκτεταμένη λίστα των ενοτήτων που η εντολή <command>build</command> μπορεί να δομήσει.

source: The <option>--skip</option>, <option>--start-at</option>, <option>--tags</option>, and <option>--ignore-suggests</option> options are processed as per the <link linkend="command-reference-build"><command>build</command></link> command.
el: Οι επιλογές <option>--skip</option>, <option>--start-at</option>, <option>--tags</option> και <option>--ignore-suggests</option> επεξεργάζονται όπως η εντολή <link linkend="command-reference-build"><command>build</command></link>.

source: List all the modules from the module set regardless of the build dependencies.
el: Καταχωρήστε όλες τις ενότητες από την ομάδα ενοτήτων, ανεξάρτητα από τις εξαρτήσεις δόμησης.

source: If a module is set to a branch, show the branch name with the module name.
el: Εάν μία ενότητα ορισθεί σε έναν κλάδο, εμφανίστε το όνομα του κλάδου με το όνομα της ενότητας.

source: This option forces JHBuild to list optional dependencies.
el: Αυτή η επιλογή εξαναγκάζει το JHBuild να εμφανίσει τις προαιρετικές εξαρτήσεις.

source: The <command>rdepends</command> command displays the reverse dependencies of a module.
el: Η εντολή <command>rdepends</command> εμφανίζει τις αντίστροφες εξαρτήσεις μιας ενότητας.

source: Show dependency path next to modules.
el: Εμφάνιση της διαδρομής εξάρτησης δίπλα στις ενότητες.

source: Limit display to modules directly depending on specified module.
el: Περιορίστε την εμφάνιση στις άμεσες ενότητες ανάλογα με τη συγκεκριμένη ενότητα.

source: run
el: εκτέλεση

source: The <command>run</command> command runs the specified command using the same environment that JHBuild uses when building modules.
el: Η εντολή <command>run</command> εκτελεί τη συγκεκριμένη εντολή χρησιμοποιώντας το ίδιο περιβάλλον που χρησιμοποιεί το JHBuild όταν δομεί ενότητες.

source: If using JHBuild to build GNOME, this command can be useful in X startup scripts.
el: Αν χρησιμοποιείτε JHBuild για να δομήσετε το GNOME, αυτή η εντολή μπορεί να είναι χρήσιμη σε σενάρια εκκίνησης Χ.

source: Run the command in the build directory of the specified module.
el: Εκτελέστε την εντολή στον κατάλογο δόμησης της ορισμένης ενότητας.

source: Run the command in the source directory of the specified module.
el: Εκτελέστε την εντολή στον πηγαίο κατάλογο της ορισμένης ενότητας.

source: sanitycheck
el: έλεγχος υγείας

source: The <command>sanitycheck</command> command performs a number of checks to verify the build environment is okay.
el: Η εντολή <command>sanitycheck</command> εκτελεί έναν αριθμό ελέγχων για να επιβεβαιώσει ότι το περιβάλλον δόμησης είναι εντάξει.

source: Some of the checks include:
el: Μερικοί από τους ελέγχους περιλαμβάνουν:

source: The checkout and install prefixes are writable.
el: Τον έλεγχο εξόδου και εγκατάστασης προθεμάτων που είναι εγγράψιμα.

source: The required build tools are installed.
el: Τα απαιτούμενα εργαλεία δόμησης που είναι εγκατεστημένα.

source: Some commonly used macros are available in the search paths of the <command>aclocal</command> commands associated with the various versions of <command>automake</command>.
el: Μερικές συνήθως χρησιμοποιούμενες μακροεντολές είναι διαθέσιμες στις διαδρομές αναζήτησης των εντολών <command>aclocal</command> που είναι συσχετισμένες με τις ποικίλες εκδόσεις του <command>automake</command>.

source: The XML catalog contains the DocBook DTD and stylesheets.
el: Ο κατάλογος XML περιέχει το DocBook DTD και φύλλα τεχνοτροπίας.

source: shell
el: κέλυφος

source: The <command>shell</command> command starts the user's shell with the same environment as JHBuild uses when building modules.
el: Η εντολή <command>shell</command> ξεκινά το κέλυφος του χρήστη με το ίδιο περιβάλλον που χρησιμοποιεί το JHBuild όταν δομεί ενότητες.

source: This command is equivalent to the following:
el: Αυτή η εντολή είναι ισοδύναμη με την παρακάτω:

source: The <envar>UNDER_JHBUILD</envar> environment variable will be set to "true" when this shell is active. You can use the presence of that variable to customize your shell's prompt to indicate that you indeed are under a jhbuild-controlled shell. For example, you may want to put this in your <filename>.bashrc</filename>:
el: Η μεταβλητή περιβάλλοντος <envar>UNDER_JHBUILD</envar> θα οριστεί ‎"αληθή" όταν αυτό το κέλυφος είναι ενεργό. Μπορείτε να χρησιμοποιήσετε την παρουσία αυτής της μεταβλητής για να προσαρμόσετε την προτροπή του κελύφους για να δείξετε ότι είσαστε πραγματικά στο κέλυφος που ελέγχεται από το jhbuild. Για παράδειγμα, ίσως θέλετε να βάλετε αυτό στο <filename>.bashrc</filename>:

source: This will make your bash shell display <literal>[jhbuild]</literal> before your normal prompt, making it easier to see which shells are under a jhbuild environment.
el: Αυτό θα προκαλέσει την εφάνιση του κέλυφους σας bash <literal>[jhbuild]</literal> πριν την κανονική σας προτροπή, καθιστώντας ευκολότερο να δείτε ποια κελύφη είναι σε περιβάλλον jhbuild.

source: sysdeps
el: εξαρτήσεις συστήματος

source: The <command>sysdeps</command> command displays:
el: Η εντολή <command>sysdeps</command> εμφανίζει:

source: a list of installed system packages which will be used during the build. JHBuild will not build these modules and opt to use the system package instead.
el: μια λίστα των εγκατεστημένων πακέτων του συστήματος που θα χρησιμοποιηθεί κατά τη διάρκεια της δόμησης. Το JHBuild δεν θα δομήσει αυτές τις ενότητες και προαιρετικά θα χρησιμοποιήσει το πακέτο του συστήματος.

source: a list of required packages. To begin a build the packages must be provided by your system.
el: μια λίστα των απαιτούμενων πακέτων. Για την έναρξη της δόμησης τα πακέτα πρέπει να παρέχονται από το σύστημά σας.

source: a list of optional packages. The corresponding system package was not found or too old. JHBuild will build the module. Optional packages will not be displayed if <link linkend="cfg-partial-build"><varname>partial_build</varname></link> is <constant>False</constant>.
el: μια λίστα των προαιρετικών πακέτων. Το αντίστοιχο πακέτο του συστήματος δεν βρέθηκε ή ήταν υπερβολικά παλιό. Το JHBuild θα δομήσει την ενότητα. Τα προαιρετικά πακέτα δεν θα εμφανιστούν αν η <link linkend="cfg-partial-build"><varname>partial_build</varname></link> είναι <constant>ψευδής</constant>.

source: This option installs system packages which are dependencies of the moduleset. The installation method depends on your distribution. System packages are installed using <application>PackageKit</application>, if available. For distributions using <application>APT</application> such as <systemitem class="osname">Debian</systemitem> and <systemitem class="osname">Ubuntu</systemitem>, this option requires <application>apt-file</application> to be installed.
el: Αυτή η επιλογή εγκαθιστά πακέτα του συστήματος που είναι εξαρτήσεις της ομάδα ενοτήτων. Η μέθοδος εγκατάστασης εξαρτάται από τη διανομή σας. Τα πακέτα του συστήματος εγκαθίστανται χρησιμοποιώντας το <application>PackageKit</application>, αν είναι διαθέσιμο. Για διανομές που χρησιμοποιούν <application>APT</application> όπως <systemitem class="osname">Debian</systemitem> και <systemitem class="osname">Ubuntu</systemitem>, αυτή η επιλογή απαιτεί το <application>apt-file</application> για να εγκατασταθεί.

source: <command>sysdeps</command> example
el: Παράδειγμα <command>sysdeps</command>

source: The <command>tinderbox</command> command is similar to <command>build</command>, but writes all terminal output to HTML files suitable for publishing on a website. It can be used to set up systems similar to Mozilla's Tinderbox, or Debian's Buildd.
el: Η εντολή <command>tinderbox</command> είναι παρόμοια με την <command>build</command>, αλλά γράφει όλες τις εξόδους του τερματικού σε αρχεία HTML κατάλληλα για δημοσίευση σε έναν ιστότοπο. Μπορεί να χρησιμοποιηθεί για να ρυθμίσει συστήματα παρόμοια με το Tinderbox του Mozilla, ή το Buildd του Debian.

source: The <option>--autogen</option>, <option>--clean</option>, <option>--distclean</option>, <option>--no-network</option>, <option>--skip</option>, <option>--start-at</option>, <option>-D</option>, <option>-C</option>, <option>-N</option>, <option>-f</option> and <option>--nodeps</option> options are processed as per the <link linkend="command-reference-build"><command>build</command></link> command.
el: Οι <option>--autogen</option>, <option>--clean</option>, <option>--distclean</option>, <option>--no-network</option>, <option>--skip</option>, <option>--start-at</option>, <option>-D</option>, <option>-C</option>, <option>-N</option>, <option>-f</option> και <option>--nodeps</option> οι επιλογές επεξεργάζονται όπως η εντολή <link linkend="command-reference-build"><command>build</command></link>.

source: The directory to write the HTML files. JHBuild will create an index (<filename>index.html</filename>) and a HTML file for each module.
el: Ο κατάλογος για να γράψετε τα αρχεία HTML. Το JHBuild θα δημιουργήσει ένα ευρετήριο (<filename>index.html</filename>) και ένα αρχείο HTML για κάθε ενότητα.

source: uninstall
el: απεγκατάσταση

source: The <command>uninstall</command> command uninstalls one or more modules.
el: Η εντολή <command>uninstall</command> απεγκαθιστά μία ή περισσότερες ενότητες.

source: update
el: ενημέρωση

source: The <command>update</command> command is similar to <command>build</command>, but only performs the download or update stage for modules without building them.
el: Η εντολή <command>update</command> είναι παρόμοια μες την εντολή <command>build</command>, αλλά εκτελεί μόνο τη μεταφόρτωση ή ενημέρωση του σταδίου για ενότητες χωρίς να τις δομήσει.

source: The <option>--skip</option>, <option>--start-at</option>, <option>--tags</option>, <option>--ignore-suggests</option> and <option>-D</option> options are processed as per the <link linkend="command-reference-build"><command>build</command></link> command.
el: Τα <option>--skip</option>, <option>--start-at</option>, <option>--tags</option>, <option>--ignore-suggests</option> και οι επιλογές <option>-D</option> επεξεργάζονται όπως η εντολή <link linkend="command-reference-build"><command>build</command></link>.

source: The <command>updateone</command> command is similar to <command>update</command>, but it does not update the dependent modules. It is useful for updating one or more modules.
el: Η εντολή <command>updateone</command> είναι παρόμοια με την <command>update</command>, αλλά δεν ενημερώνει τις εξαρτημένες ενότητες. Είναι χρήσιμη για ενημέρωση μιας ή περισσότερων ενοτήτων.

source: The <option>-D</option> option is processed as per the <link linkend="command-reference-build"><command>build</command></link> command.
el: Η επιλογή <option>-D</option> επεξεργάζεται όπως η εντολή <link linkend="command-reference-build"><command>build</command></link>.

source: Configuration File Reference
el: Αναφορά αρχείου ρυθμίσεων

source: The <filename>~/.config/jhbuildrc</filename> file uses standard Python syntax. The file is run, and the resulting variables defined in the namespace are used to control how JHBuild acts. A set of default values are inserted into the namespace before running the user's configuration file.
el: Το αρχείο <filename>~/.config/jhbuildrc</filename> χρησιμοποιεί την τυπική σύνταξη Python. Το αρχείο εκτελείται και οι τελικές μεταβλητές που ορίστηκαν στον χώρο ονομάτων χρησιμοποιούνται για να ελέγξουν πώς δρα το JHBuild. Μια ομάδα προεπιλεγμένων τιμών εισάγεται στον χώρο ονομάτων πριν την εκτέλεση του αρχείου ρυθμίσεων του χρήστη.

source: Boolean configuration variables are set using syntax as demonstrated in the following example:
el: Οι μεταβλητές ρύθμισης Μπουλ ορίζονται χρησιμοποιώντας σύνταξη όπως εμφανίζεται στο παρακάτω παράδειγμα:

source: String configuration variables are set using syntax as demonstrated in the following example:
el: Οι μεταβλητές ρύθμισης συμβολοσειράς ορίζονται χρησιμοποιώντας σύνταξη όπως εμφανίζεται στο παρακάτω παράδειγμα:

source: List configuration variables are set using syntax as demonstrated in the following example:
el: Οι μεταβλητές ρύθμισης λίστας ορίζονται χρησιμοποιώντας σύνταξη όπως εμφανίζεται στο παρακάτω παράδειγμα:

source: Dictionary configuration variables are set using syntax as demonstrated in the following example:
el: Οι μεταβλητές ρύθμισης λεξικού ορίζονται χρησιμοποιώντας σύνταξη όπως εμφανίζεται στο παρακάτω παράδειγμα:

source: Configuration Variables
el: Μεταβλητές ρύθμισης

source: A boolean value if set to <constant>True</constant>, always run <command>autogen.sh</command>. This is equivalent to passing <option>--autogen</option> option to JHBuild. Defaults to <constant>False</constant>.
el: Μια τιμή Μπουλ αν οριστεί σε <constant>αληθή</constant>, εκτελεί πάντα μια <command>autogen.sh</command>. Αυτό είναι το ισοδύναμο με το πέρασμα της επιλογής <option>--autogen</option> στο JHBuild. Προεπιλογή το <constant>ψευδής</constant>.

source: A string containing arguments passed to the <command>autogen.sh</command> script of all modules. Can be overridden for particular modules using the <varname>module_autogenargs</varname> dictionary.
el: Μια συμβολοσειρά που περιέχει ορίσματα τα οποία περνούν στο σενάριο <command>autogen.sh</command> όλων των ενοτήτων. Μπορεί να αντικατασταθεί για συγκεκριμένες ενότητες χρησιμοποιώντας το λεξικό <varname>module_autogenargs</varname>.

source: A dictionary specifying which branch to use for specific modules. This is useful if you are making some changes on a branch of a module and want JHBuild to build that branch instead of the one listed in the module set.
el: Ένα λεξικό που καθορίζει ποιος κλάδος θα χρησιμοποιηθεί για συγκεκριμένες ενότητες. Αυτό είναι χρήσιμο αν κάνετε κάποιες αλλαγές σε έναν κλάδο ενότητας και θέλετε το JHBuild να δομήσει αυτόν τον κλάδο αντί για αυτόν που αναφέρεται στην ομάδα ενοτήτων.

source: The definition of branches depends on the module VCS:
el: Ο ορισμός των κλάδων εξαρτάται από την ενότητα VCS:

source: CVS: revision. E.g. <literal>'BRANCH-PROJECT-0_8'</literal>
el: CVS: αναθεώρηση. Π.χ. <literal>'BRANCH-PROJECT-0_8'</literal>

source: Bazaar: URI of module branch. E.g. <literal>'http://bzr.example.net/project/gnome-2-28'</literal>
el: Bazaar: URI του κλάδου ενότητας. Π.χ. <literal>'http://bzr.example.net/project/gnome-2-28'</literal>

source: Git: tuple, with first part being an optional repository (or the None value) and the second part the name of the branch. E.g. <literal>('git://git.example.net/project', 'gnome-2-28')</literal>
el: Git: πλειάδα, με το πρώτο μέρος να είναι ένα προαιρετικό αποθετήριο (ή η τιμή κανένα) και το δεύτερο μέρος του ονόματος του κλάδου. Π.χ. <literal>('git://git.example.net/project', 'gnome-2-28')</literal>

source: Simple example
el: Απλό παράδειγμα

source: Subversion: URI of module branch E.g. <literal>'svn://svn.example.net/project/gnome-2-28'</literal>
el: Subversion: URI του κλάδου της ενότητας Π.χ. <literal>'svn://svn.example.net/project/gnome-2-28'</literal>

source: A <function>printf</function> style formatting pattern used to generate build directory names. This is only used when using separate source and build trees. The <literal>%s</literal> in the format string will be replaced with <varname>checkoutdir</varname>. Defaults to <literal>'%s'</literal>.
el: Ένα μοτίβο μορφοποίησης τεχνοτροπίας <function>printf</function> που χρησιμοποιείται για να δημιουργήσει ονόματα καταλόγου δόμησης. Αυτό χρησιμοποιείται μόνο όταν χρησιμοποιείτε ξεχωριστή πηγή και δένδρα δόμησης. Το <literal>%s</literal> στη μορφή συμβολοσειράς θα αντικατασταθεί με <varname>checkoutdir</varname>. Προεπιλογή το <literal>'%s'</literal>.

source: A string specifying the parent directory to place build trees. Defaults to <constant>None</constant>, which causes builds to be performed within the source trees.
el: Μια συμβολοσειρά που ορίζει τον γονικό κατάλογο για τοποθέτηση δένδρων δόμησης. Προεπιλογή το <constant>Κανένα</constant>, που προκαλεί την εκτέλεση δομήσεων στα πηγαία δένδρα.

source: A string specifying which buildscript to use. The recommended setting is the default, <literal>terminal</literal>. In particular, do not set to <literal>gtk</literal>.
el: Μια συμβολοσειρά που καθορίζει ποιο σενάριο δόμησης θα χρησιμοποιηθεί. Η συνιστώμενη ρύθμιση είναι η προεπιλογή, <literal>τερματικό</literal>. Ειδικά, μην ορίζετε σε <literal>gtk</literal>.

source: A string specifying which modules to build. The three possible options are <literal>all</literal>, to build all modules requested, <literal>updated</literal> to build only modules which have changed, or <literal>updated-deps</literal> to build modules which have changed or which have dependencies which have changed. Defaults to <literal>updated-deps</literal>.
el: Μια συμβολοσειρά που ορίζει ποιες ενότητες θα δομηθούν. Οι τρεις δυνατές επιλογές είναι <literal>όλα</literal>, για τη δόμηση όλων των ζητούμενων ενοτήτων, <literal>ενημέρωση</literal> για τις ενότητες μόνο που έχουν αλλάξει, ή <literal>ενημέρωση εξαρτήσεων</literal> για δόμηση των ενοτήτων που έχουν αλλάξει ή που έχουν εξαρτήσεις που έχουν αλλάξει. Προεπιλογή το <literal>ενημέρωση εξαρτήσεων</literal>.

source: A string specifying the directory to unpack source trees to. Unless <varname>buildroot</varname> is set, builds will occur in this directory too. Defaults to <filename>~/checkout/gnome</filename>.
el: Μια συμβολοσειρά που καθορίζει τον φάκελο στον οποίο θα αποσυμπιεστούν τα πηγαία δένδρα. Εκτός κι αν είναι ορισμένη η <varname>buildroot</varname>, οι δομήσεις θα γίνονται σε αυτόν τον φάκελο επίσης. Η προεπιλογή είναι <filename>~/checkout/gnome</filename>.
