Repository: CrandellWS/jhbuild
Catalog: doc/*/*.po
Languages: el

# _
source: translator-credits
el: Θάνος Τρυφωνίδης <tomtryf@gmail.com>, 2012 Δημήτρης Σπίγγος <dmtrs32@gmail.com>, 2013 Μαρία Θουκυδίδου <marablack3@gmail.com>, 2014

source: JHBuild Manual
el: Εγχειρίδιο JHBuild

source: <revnumber>JHBuild Manual v0.5</revnumber> <date>January 2008</date>
el: <revnumber>Εγχειρίδιο JHBuild v0.5</revnumber> <date>Ιανουάριος 2008</date>

source: <revnumber>JHBuild Manual v0.1</revnumber> <date>August 2007</date>
el: <revnumber>Εγχειρίδιο JHBuild v0.1</revnumber> <date>Αύγουστος 2007</date>

source: JHBuild is a tool used to build the whole GNOME desktop from the version control system. JHBuild can also be customized to build other projects too.
el: Το JHBuild είναι ένα εργαλείο που χρησιμοποιείται για τη δόμηση ολόκληρης της επιφάνειας εργασίας του GNOME από το σύστημα ελέγχου εκδόσεων. Μπορεί επίσης να προσαρμοστεί ώστε να δομήσει και άλλα έργα.

source: Introduction
el: Εισαγωγή

source: JHBuild is a tool designed to ease building collections of source packages, called <quote>modules</quote>. JHBuild uses <quote>module set</quote> files to describe the modules available to build. The <quote>module set</quote> files include dependency information that allows JHBuild to discover what modules need to be built and in what order.
el: Το JHBuild είναι ένα εργαλείο σχεδιασμένο ώστε να διευκολύνει τη δόμηση συλλογών από πακέτα, που ονομάζονται <quote>ενότητες</quote>. Το JHBuild χρησιμοποιεί αρχεία <quote>ομάδων ενοτήτων</quote> για να περιγράψει τις διαθέσιμα προς κτίσιμο ενότητες. Τα αρχεία <quote>ομάδων ενοτήτων</quote> περιέχουν πληροφορίες εξαρτήσεων που επιτρέπουν στο JHBuild να ανακαλύπτει ποιες ενότητες χρειάζεται να κτιστούν και με ποια σειρά.

source: JHBuild was originally written for building <ulink url="http://www.gnome.org">GNOME</ulink>, but has since been extended to be usable with other projects. A <quote>module set</quote> file can be hosted on a web server, allowing for build rules independent of the JHBuild project.
el: Το JHBuild αρχικά γράφτηκε για τη δόμηση του <ulink url="http://www.gnome.org">GNOME</ulink>, αλλά έχει έκτοτε επεκταθεί για να μπορεί να χρησιμοποιηθεί και με άλλα έργα. Ένα αρχείο <quote>ομάδας ενοτήτων</quote> μπορεί να φιλοξενείται σε έναν εξυπηρετητή διαδικτύου, επιτρέποντας κανόνες δόμησης ανεξάρτητα από το έργο JHBuild.

source: JHBuild can build modules from a variety of sources, including <ulink url="http://www.cvshome.org/">CVS</ulink>, <ulink url="http://subversion.tigris.org/">Subversion</ulink>, <ulink url="http://www.bazaar-vcs.org/">Bazaar</ulink>, <ulink url="http://darcs.net/">Darcs</ulink>, <ulink url="http://git.or.cz/">Git</ulink> and <ulink url="http://www.selenic.com/mercurial/">Mercurial</ulink> repositories, as well as Tar and Zip archives hosted on web or FTP sites. JHBuild can build modules using a variety of build systems, including Autotools, CMake, WAF, Python Distutils and Perl Makefiles.
el: Το JHBuild μπορεί να δομήσει ενότητες από μια ποικιλία από πηγές, που περιλαμβάνουν αποθετήρια <ulink url="http://www.cvshome.org/">CVS</ulink>, <ulink url="http://subversion.tigris.org/">Subversion</ulink>, <ulink url="http://www.bazaar-vcs.org/">Bazaar</ulink>, <ulink url="http://darcs.net/">Darcs</ulink>, <ulink url="http://git.or.cz/">Git</ulink> and <ulink url="http://www.selenic.com/mercurial/">Mercurial</ulink> καθώς και συμπιεσμένα αρχεία Tar και Zip που φιλοξενούνται σε εξυπηρετητές FTP. Το JHBuild μπορεί να δομήσει ενότητες χρησιμοποιώντας διάφορα συστήματα δόμησης, που περιλαμβάνουν τα Autotools, CMake, WAF, Python Distutils και Perl Makefiles.

source: JHBuild is not intended as a replacement for the distribution's package management system. Instead, it makes it easy to build software into a separate install prefix without interfering with the rest of the system.
el: Το JHBuild δεν προτίθεται να αντικαταστήσει το σύστημα διαχείρισης πακέτων της διανομής. Αντί αυτού, διευκολύνει τη δόμηση λογισμικού σε μια ξεχωριστή εγκατάσταση, χωρίς να εμπλέκεται με το υπόλοιπο σύστημα.

source: Getting Started
el: Ξεκινώντας

source: JHBuild requires a few set up steps to be run before building software. JHBuild requires some prerequisite software, and it is necessary to install prerequisite tools needed to obtain and build the software modules.
el: Το JHBuild απαιτεί μερικές ρυθμίσεις προτού κτίσει λογισμικό. Έχει επίσης κάποιο προαπαιτούμενο λογισμικό, και είναι αναγκαίο να εγκατασταθούν τα προαπαιτούμενα αναγκαία εργαλεία για τη λήψη και το κτίσιμο των ενοτήτων λογισμικού.

source: Installing JHBuild
el: Εγκαθιστώντας το JHBuild

source: JHBuild requires a Python runtime. Verify Python &gt;= 2.3 is installed.
el: Το JHBuild απαιτεί έναν χρόνο εκτέλεσης Python. Επιβεβαιώστε ότι το Python &gt;= 2.3 είναι εγκατεστημένο.

source: The recommended way to download JHBuild is via the version control system, <command>git</command>. This can be achieved with the following command. It is recommended to run the command from a new directory where all source code will be installed, for example, <filename>~/jhbuild/checkout</filename>.
el: Ο συνιστώμενος τρόπος για να κατεβάσετε το JHBuild είναι με το Σύστημα ελέγχου εκδόσεων (VCS) <command>git</command>. Αυτό μπορεί να επιτευχθεί με την εντολή που ακολουθεί. Συνιστάται να εκτελέσετε την εντολή από ένα νέο φάκελο, όπου θα εγκατασταθεί όλος ο πηγαίος κώδικας, για παράδειγμα <filename>~/checkout/gnome</filename>.

source: This will download JHBuild into a new folder named <filename>jhbuild</filename> under the current directory. Now to build and install JHBuild:
el: Αυτό θα κατεβάσει το JHBuild σε ένα νέο φάκελο που ονομάζεται <filename>jhbuild</filename> μέσα στον τρέχοντα φάκελο. Τώρα για να κτίσετε και να εγκαταστήσετε το JHBuild:

source: If <application>gnome-common</application>, <application>yelp-tools</application> and <application>autotools</application> are available, <filename>autogen.sh</filename> will configure JHBuild to install via <application>autotools</application>. If <application>gnome-common</application>, <application>yelp-tools</application> and <application>autotools</application> are not available, <filename>autogen.sh</filename> will configure JHBuild to install via a plain Makefile. To always use the plain Makefile method pass <option>--simple-install</option> to <filename>autogen.sh</filename>.
el: Αν τα <application>gnome-common</application>, <application>yelp-tools</application> και <application>autotools</application> είναι διαθέσιμα, το <filename>autogen.sh</filename> θα ρυθμίσει το JHBuild να εγκαταστήσει μέσα από <application>autotools</application>. Αν τα <application>gnome-common</application>, <application>yelp-tools</application> και <application>autotools</application> δεν είναι διαθέσιμα, το <filename>autogen.sh</filename> θα ρυθμίσει το JHBuild να εγκαταστήσει μέσα από ένα απλό Makefile. Για να χρησιμοποιείτε πάντα τη μέθοδο απλού Makefile περάστε <option>--simple-install</option> στο <filename>autogen.sh</filename>.

source: If the above steps complete successfully, a small shell script will be installed in <filename>~/.local/bin</filename> to start JHBuild. Add <filename>~/.local/bin</filename> to the <envar>PATH</envar>:
el: Αν τα πιο πάνω βήματα ολοκληρωθούν επιτυχώς, ένα μικρό σενάριο εντολών κελύφους θα εγκατασταθεί στο <filename>~/.local/bin</filename> το οποίο θα εκκινεί το JHBuild. Προσθέστε το <filename>~/.local/bin</filename> στο <envar>PATH</envar>:

source: To permanently add <filename>~/.local/bin</filename> to the <envar>PATH</envar> variable, run the following command:
el: Για να προσθέσετε μόνιμα το <filename>~/.local/bin</filename> στη μεταβλητή <envar>PATH</envar>, εκτελέστε την ακόλουθη εντολή:

source: Configuring JHBuild
el: Παραμετροποίηση του JHBuild

source: JHBuild can be configured via a configuration file. The default location is <filename>~/.config/jhbuildrc</filename>. If a configuration file does not exist, the defaults are used. The configuration file uses Python syntax. An example is provided, see <filename>examples/sample.jhbuildrc</filename>. Copy <filename>examples/sample.jhbuildrc</filename> to <filename>~/.config/jhbuildrc</filename> and customize as required.
el: Το JHBuild μπορεί να ρυθμιστεί μέσα από ένα αρχείο ρυθμίσεων. Η προεπιλεγμένη θέση είναι <filename>~/.config/jhbuildrc</filename>. Αν δεν υπάρχει αρχείο ρυθμίσεων, χρησιμοποιούνται οι προεπιλογές. Το αρχείο ρυθμίσεων χρησιμοποιεί σύνταξη Python. Δίνεται ένα παράδειγμα, δείτε <filename>examples/sample.jhbuildrc</filename>. Αντιγράψτε το <filename>examples/sample.jhbuildrc</filename> στο <filename>~/.config/jhbuildrc</filename> και προσαρμόστε το όπως απαιτείται.

source: The sample configuration will make JHBuild build the <application>meta-gnome-core</application> and <application>meta-gnome-apps-tested</application> modules and dependencies from the <systemitem>gnome-apps</systemitem> module set. JHBuild will unpack source trees to <filename>~/jhbuild/checkout/</filename> and install all files to subdirectories of <filename>~/jhbuild/install/</filename>. The two directories must be writable.
el: Η διαμόρφωση του δείγματος θα κάνει το JHBuild να δομήσει τις ενότητες <application>meta-gnome-core</application> και <application>meta-gnome-apps-tested</application> και τις εξαρτήσεις του από την ομάδα ενοτήτων <systemitem>gnome-apps</systemitem>. Το JHBuild θα ξεπακετάρει τα πηγαία δένδρα στο <filename>~/checkout/gnome</filename> και θα εγκαταστήσει όλα τα αρχεία σε υποκαταλόγους του <filename>/opt/gnome</filename>. Οι δύο αυτοί κατάλογοι πρέπει να είναι εγγράψιμοι.

source: Configuration variables are documented in <xref linkend="config-reference"/>. The most commonly used variables are:
el: Οι μεταβλητές παραμετροποίησης τεκμηριώνονται στο <xref linkend="config-reference"/>. Οι πιο κοινά χρησιμοποιούμενες μεταβλητές είναι:

source: A dictionary that can be used to specify an alternative repository location for a particular repository. This configuration variable is useful to a module developer. By default, JHBuild will check out code from repositories using an anonymous repository location. The dictionary keys are short repository names and the values are alternative repository location strings. For example:
el: Ένα λεξικό το οποίο μπορεί να χρησιμοποιηθεί για να οριστεί μια εναλλακτική τοποθεσία αποθετηρίου για ένα συγκεκριμένο αποθετήριο. Αυτή η μεταβλητή παραμετροποίησης είναι χρήσιμη σε έναν προγραμματιστή ενοτήτων. Από προεπιλογή, το JHBuild θα κατεβάσει τον κώδικα από αποθετήρια χρησιμοποιώντας μια ανώνυμη τοποθεσία αποθετηρίου. Τα κλειδιά του λεξικού είναι σύντομα ονόματα αποθετηρίων και οι αξίες τους είναι συμβολοσειρές εναλλακτικών τοποθεσιών αποθετηρίων. Για παράδειγμα:

source: repos['git.gnome.org'] = 'ssh://<replaceable>username</replaceable>@git.gnome.org/git/'
el: repos['git.gnome.org'] = 'ssh://<replaceable>όνομα χρήστη</replaceable>@git.gnome.org/git/'

source: A string or list of strings specifying the name(s) of the module set(s) to use. This can either be the filename of a moduleset included with JHBuild (excluding the path and extension), or a full HTTP URL to an externally managed moduleset. HTTP URL modulesets are cached locally. If a module with the same name is present in more than one moduleset, the last set listed takes priority. Modulesets provided with JHBuild are updated to match the current GNOME development release.
el: Μια συμβολοσειρά ή λίστα συμβολοσειρών που καθορίζουν το όνομα ή ονόματα της ομάδας ή των ομάδων ενοτήτων που θα χρησιμοποιηθούν. Αυτά μπορεί να είναι είτε το όνομα μιας ομάδας ενοτήτων που περιλαμβάνεται με το JHBuild (χωρίς τη διαδρομή και την επέκταση αρχείου), είτε ένα πλήρες HTTP URL προς μια εξωτερικά διαχειριζόμενη ομάδα ενοτήτων. Οι ομάδες ενοτήτων HTTP URL αποθηκεύονται προσωρινά τοπικά. Αν μια ενότητα με το ίδιο όνομα υπάρχει σε περισσότερες από μία ομάδες ενοτήτων, η τελευταία ομάδα στη λίστα έχει την προτεραιότητα. Οι ομάδες ενοτήτων που παρέχονται με το JHBuild ενημερώνονται για να ταιριάζουν με την τρέχουσα έκδοση ανάπτυξης του GNOME.

source: A list of strings specifying the modules to build. The list of modules actually built will be recursively expanded to include all the dependencies unless the <link linkend="command-reference-buildone"> <command>buildone</command></link> command is used. Defaults to <literal>['meta-gnome-desktop']</literal>.
el: Μια λίστα συμβολοσειρών που καθορίζουν τις ενότητες που θα δομηθούν. Η λίστα ενοτήτων που πραγματικά θα δομηθούν θα επεκταθεί κυκλικά ώστε να συμπεριλαμβάνει όλες τις εξαρτήσεις, εκτός και αν χρησιμοποιηθεί η εντολή <link linkend="command-reference-buildone"><command>buildone</command></link>. Η προεπιλογή είναι <literal>['meta-gnome-desktop']</literal>.

source: A string specifying the directory to unpack source trees to. Unless <link linkend="cfg-buildroot"> <varname>buildroot</varname></link> is set, builds will occur in this directory too. Defaults to <filename>~/jhbuild/checkout</filename>.
el: Μια συμβολοσειρά η οποία καθορίζει τον φάκελο στον οποίο θα ξεπακεταριστούν τα δένδρα κώδικα. Εκτός και αν είναι ορισμένη η <link linkend="cfg-buildroot"><varname>buildroot</varname></link>, οι δομήσεις θα γίνονται και σε αυτόν τον φάκελο. Η προεπιλογή είναι <filename>~/checkout/gnome2</filename>.

source: A string specifying the prefix to install modules to. <varname>prefix</varname> must be an absolute path. This directory must be writable. Defaults to <literal>'~/jhbuild/install/'</literal>.
el: Μια συμβολοσειρά καθορίζει το πρόθεμα στο οποίο θα εγκατασταθούν οι ενότητες. Το <varname>πρόθεμα</varname> πρέπει να είναι απόλυτη διαδρομή. Αυτός ο κατάλογος πρέπει να είναι εγγράψιμος. Η προεπιλογή είναι <literal>'/opt/gnome'</literal>.

source: A string containing arguments passed to the <command>autogen.sh</command> script of all modules. Can be overridden for particular modules using the <link linkend="cfg-module-autogenargs"> <varname>module_autogenargs</varname></link> dictionary.
el: Μια συμβολοσειρά που περιέχει ορίσματα τα οποία περνούν στο σενάριο εντολών <command>autogen.sh</command> όλων των ενοτήτων. Μπορεί να παρακαμφθεί για συγκεκριμένες ενότητες χρησιμοποιώντας το λεξικό <link linkend="cfg-module-autogenargs"><varname>module_autogenargs</varname></link>.

source: A string listing additional arguments to be passed to <command>make</command>. JHBuild will automatically append the parallel execution option (<option>-j</option>) based upon available CPU cores. Defaults to <literal>''</literal>.
el: Μια συμβολοσειρά με επιπρόσθετα ορίσματα που θα περαστούν στο <command>make</command>. Το JHBuild θα προσαρτήσει αυτόματα την επιλογή της παράλληλης εκτέλεσης (<option>-j</option>) με βάση τους διαθέσιμους πυρήνες CPU. Η προεπιλογή είναι <literal>''</literal>.

source: Build Prerequisites
el: Προαπαιτούμενα για τη δόμηση

source: Before any modules can be built, it is necessary to have certain build tools installed. Common build tools include the GNU Autotools (<application>autoconf</application>, <application>automake</application>, <application>libtool</application> and <application>gettext</application>), The GNU Toolchain (<application>binutils</application>, <application>gcc</application>, <application>g++</application>), make, pkg-config and Python, depending on which modules will be built.
el: Προτού μπορούν να δομηθούν οποιεσδήποτε ενότητες, είναι αναγκαίο να είναι εγκατεστημένα κάποια εργαλεία δόμησης. Τα κοινά εργαλεία δόμησης περιλαμβάνουν τα GNU Autotools (<application>autoconf</application>, <application>automake</application>, <application>libtool</application> και <application>gettext</application>). Τα GNU Toolchain (<application>binutils</application>, <application>gcc</application>, <application>g++</application>), make, το pkg-config και την Python, ανάλογα με το ποιες ενότητες θα δομηθούν.

source: JHBuild can check the tools are installed using the <command>sanitycheck</command> command:
el: Το JHBuild μπορεί να ελέγξει αν είναι εγκατεστημένα αυτά τα εργαλεία χρησιμοποιώντας την εντολή <command>sanitycheck</command>:

source: If this command displays any messages, please install the required package from your distribution's repository. A list of <ulink url="http://live.gnome.org/JhbuildDependencies">package names </ulink> for different distributions is maintained on the GNOME wiki. Run the <command>sanitycheck</command> command again after installing the distribution's packages to ensure the required tools are present.
el: Αν αυτή η εντολή εμφανίσει οποιοδήποτε μήνυμα, εγκαταστήστε παρακαλώ το απαιτούμενο πακέτο από το αποθετήριο της διανομής σας. Μια λίστα από <ulink url="http://live.gnome.org/JhbuildDependencies">ονόματα πακέτων</ulink> για διαφορετικές διανομές διατηρείται στο βίκι του GNOME. Εκτελέστε την εντολή <command>sanitycheck</command> ξανά μετά την εγκατάσταση των πακέτων της διανομής για να βεβαιωθείτε ότι τα απαιτούμενα εργαλεία είναι παρόντα.

source: Using JHBuild
el: Χρησιμοποιώντας το JHBuild

source: After set up is complete, JHBuild can be used to build software. To build all the modules selected in the <filename>~/.config/jhbuildrc</filename> file, run the following command:
el: Αφού έχει ολοκληρωθεί η εγκατάσταση, το JHBuild θα μπορεί να χρησιμοποιηθεί για τη δόμηση λογισμικού. Για να δομήσετε όλες τις ενότητες που είναι επιλεγμένες στο αρχείο <filename>~/.config/jhbuildrc</filename>, εκτελέστε την ακόλουθη εντολή:

source: JHBuild will download, configure, compile and install each of the modules. If an error occurs at any stage, JHBuild will present a menu asking what to do. The choices include dropping to a shell to fix the error, rerunning the build from various stages, giving up on the module, or ignore the error and continue.
el: Το JHBuild θα κατεβάσει, θα ρυθμίσει, θα μεταγλωττίσει και θα εγκαταστήσει κάθε μία από τις ενότητες. Αν συμβεί κάποιο σφάλμα σε οποιοδήποτε στάδιο, το JHBuild θα παρουσιάσει ένα μενού και θα σας ρωτήσει τι να κάνει. Οι επιλογές περιλαμβάνουν τη μετάβαση σε ένα κέλυφος για να διορθώσετε το σφάλμα, το τρέξιμο του κτισίματος ξανά από διάφορα στάδια, την παράλειψη μίας ενότητας, ή την παράληψη του σφάλματος και τη συνέχεια.

source: Giving up on a module will cause any modules depending on the module to fail.
el: Η παράβλεψη μιας ενότητας θα οδηγήσει στην αποτυχία και όσων ενοτήτων εξαρτιούνται από αυτή.

source: Below is an example of the menu displayed:
el: Ακολουθεί ένα παράδειγμα του μενού που εμφανίζεται:

source: [1] Rerun phase build [2] Ignore error and continue to install [3] Give up on module [4] Start shell [5] Reload configuration [6] Go to phase "wipe directory and start over" [7] Go to phase "configure" [8] Go to phase "clean" [9] Go to phase "distclean" <prompt>choice:</prompt>
el: [1] Επανάληψη φάσης δόμησης [2] Παράβλεψη σφάλματος και συνέχεια εγκατάστασης [3] Παράβλεψη ενότητας [4] Εκκίνηση κελύφους [5] Επαναφόρτωση ρύθμισης [6] Μετάβαση στη φάση "απάλειψη φακέλου και εκκίνηση από την αρχή" [7] Μετάβαση στη φάση "ρύθμιση" [8] Μετάβαση στη φάση "καθαρισμός" [9] Μετάβαση στη φάση "distclean" <prompt>choice:</prompt>

source: It is also possible to build a different set of modules and their dependencies by passing the module names as arguments to the <command>build</command> command. For example, to build gtk+:
el: Είναι επίσης δυνατό το κτίσιμο μιας διαφορετικής ομάδας ενοτήτων και των εξαρτήσεων τους περνώντας τα ονόματα των ενοτήτων στην εντολή <command>build</command> command. Για παράδειγμα, για να κτίσετε το gtk+:

source: If JHBuild is cancelled part way through a build, it is possible to resume the build at a particular module using the <option>--start-at</option> option:
el: Αν το JHBuild ακυρωθεί κατά τη διάρκεια ενός κτισίματος, είναι δυνατή η συνέχιση του κτισίματος από ένα συγκεκριμένο ενότητα με χρήση της επιλογής <option>--start-at</option>:

source: To build one or more modules, ignoring their dependencies, JHBuild provides the <command>buildone</command> command. For the <command>buildone</command> command to complete successfully, all dependencies must be previously built and installed or provided by distribution packages.
el: Για να δομήσετε μία ή περισσότερες ενότητες, αγνοώντας τις εξαρτήσεις τους, το JHBuild παρέχει την εντολή <command>buildone</command>. Για να ολοκληρωθεί με επιτυχία η εντολή <command>buildone</command>, όλες οι εξαρτήσεις πρέπει να έχουν κτιστεί και εγκατασταθεί από πριν, ή να παρέχονται από πακέτα της διανομής.

source: When actively developing a module, you are likely in a source working directory. The <command>make</command> will invoke the build system and install the module. This will be a key part of your edit-compile-install-test cycle.
el: Όταν αναπτύσσεται ενεργά μια ενότητα, είσαστε πιθανόν σε έναν πηγαίο κατάλογο εργασίας. Η <command>make</command> θα καλέσει το σύστημα δόμησης και εγκατάστασης της ενότητας. Αυτό θα είναι ένα βασικό μέρος του κύκλου επεξεργασία-μεταγλώττιση-εγκατάσταση-δοκιμή.

source: To get a list of the modules and dependencies JHBuild will build, and the order they will be built, use the <command>list</command> command:
el: Για να λάβετε μια λίστα με τις ενότητες και τις εξαρτήσεις που θα κτίσει το JHBuild, και τη σειρά με την οποία θα κτιστούν, χρησιμοποιήστε την εντολή <command>list</command>:

source: To get information about a particular module, use the <command>info</command> command:
el: Για να λάβετε πληροφορίες για μια συγκεκριμένη ενότητα, χρησιμοποιήστε την εντολή <command>info</command>:

source: To download or update all the software sources without building, use the <command>update</command> command. The <command>update</command> command provides an opportunity to modify the sources before building and can be useful if internet bandwidth varies.
el: Για να κατεβάσετε ή να ενημερώσετε όλες τις πηγές λογισμικού χωρίς να κτίσετε, χρησιμοποιήστε την εντολή <command>update</command>. Η εντολή <command>update</command> παρέχει την ευκαιρία να τροποποιήσετε τις πηγές πριν το κτίσιμο και μπορεί να είναι χρήσιμη αν ποικίλει το εύρος ζώνης της σύνδεσής σας στο διαδίκτυο.

source: Later, JHBuild can build everything without downloading or updating the sources:
el: Αργότερα, το JHBuild θα μπορεί να κτίσει τα πάντα χωρίς να κατεβάσει ή να ενημερώσει τις πηγές:

source: To run a particular command with the same environment used by JHBuild, use the <command>run</command> command:
el: Για την εκτέλεση μιας συγκεκριμένης εντολής με το ίδιο χρησιμοποιούμενο περιβάλλον από το JHBuild, χρησιμοποιήστε την εντολή <command>run</command>:

source: To start a shell with the same environment used by JHBuild, use the <command>shell</command> command:
el: Για την έναρξη ενός κελύφους με το ίδιο χρησιμοποιούμενο περιβάλλον από το JHBuild, χρησιμοποιήστε την εντολή <command>shell</command>:

source: JHBuild and GNOME
el: JHBuild και GNOME

source: This section provides guidance on building, installing and running GNOME.
el: Αυτή η ενότητα παρέχει οδηγίες για τη κατασκευή, εγκατάσταση και εκτέλεση του GNOME.

source: Building GNOME
el: Δομώντας το GNOME

source: To build GNOME some development packages are required. This includes:
el: Για τη δόμηση του GNOME απαιτούνται μερικά πακέτα ανάπτυξης. Αυτό περιλαμβάνει:

source: DocBook XML DTD and XSLT stylesheets. These need to be registered in the XML catalog (<filename>/etc/xml/catalog</filename>).
el: Το DocBook XML DTD και φύλλα τεχνοτροπίας XSLT. Αυτά χρειάζεται να καταχωριστούν στον κατάλογο XML (<filename>/etc/xml/catalog</filename>).

source: X libraries
el: Βιβλιοθήκες X

source: <filename>libsmbclient</filename> from Samba (used for browsing Windows networks).
el: Το <filename>libsmbclient</filename> από το Samba (χρησιμοποιείται για περιήγηση δικτύων Windows).

source: <filename>libbz2</filename> from bzip2.
el: Το <filename>libbz2</filename> από bzip2.
